{
  "009A": "Best guess: Manages Erethian’s dialogue on the Island of Fire, covering his studies, the Dark Core, Arcadion, and the Talisman of Infinity, with topic selection and flag-based progression.",
  "009B": "Best guess: Manages the Ferryman of Skara Brae's dialogue, handling payment for passage, return trips, and refusal of sacrifice, with party member interactions (Shamino, Spark, Iolo).",
  "009F": "Best guess: Displays the current time in 12-hour format with AM/PM, adjusting for midnight and formatting minutes, likely for a clock or time display item.",
  "00B2": "Best guess: Performs a simple check or update for an object, possibly a status query or minor interaction, with minimal logic.",
  "00D2": "Best guess: Creates and positions an item (ID 377) randomly near an object if conditions are met, likely for spawning resources or loot.",
  "00E1": "Best guess: Manages state-based interactions for an object (e.g., lever or switch), adjusting quality (30 or 31) based on state, likely part of a puzzle or mechanism.",
  "00F6": "Best guess: Manages state-based interactions for an object (e.g., switch or panel), adjusting quality (30 or 31) based on state, likely part of a puzzle or interactive mechanism.",
  "00FA": "Best guess: Manages state-based interactions for an object (e.g., lever or gate), adjusting quality (30 or 31) based on state, likely part of a mechanism or puzzle.",
  "00FB": "Best guess: Manages ship sailing interaction, checking for a deed (scroll, ID 797) and displaying dialogue if missing, or handling sailing logic if conditions are met.",
  "00FC": "Best guess: Displays the current time (hour:minute) above a clock object, using a 12-hour format with leading zero for minutes.",
  "0102": "Best guess: Manages a keg interaction, displaying a message and handling specific use cases, including filling containers.",
  "0105": "Best guess: Manages a loom interaction, creating thread and cloth items when used, with an error message if threading is incorrect.",
  "010B": "Best guess: Plays a specific music track (ID 39) when triggered by event ID 1, likely for an ambient or event-based sound effect.",
  "010E": "Best guess: Manages item interactions with specific conditions, applying actions based on item state (0-3), likely for a puzzle or quest mechanism.",
  "011C": "Best guess: Displays the current time on a sundial, showing hours (6 AM to 8 PM) or noon, with a message if the sun is not visible, likely for a time-based puzzle.",
  "0122": "Closed shutters (type 1)",
  "0123": "Closed shutters (type 2)",
  "0124": "Best guess: Manages a seating interaction on a barge or chair, assigning party members to seats based on proximity and state.",
  "0128": "Best guess: Manages a ring of invisibility, toggling invisibility status for the wearer based on equip/unequip events.",
  "012A": "Best guess: Manages the Ring of Regeneration, applying health regeneration to an NPC when equipped or used, with periodic checks and random item removal.",
  "012D": "Best guess: Triggers an action for an item when event ID 1 is received, likely part of a quest or environmental interaction.",
  "012F": "Best guess: Handles item type changes and actions based on event IDs, setting an item type (303) or triggering actions for a quest item (936).",
  "0133": "Best guess: Manages a laboratory burner, checking for nearby portions and aligning them based on position and frame conditions.",
  "0142": "Open shutters (type 2)",
  "0149": "Best guess: Handles a storm cloak interaction, moving it to specific coordinates or displaying an error if used indoors.",
  "0150": "Best guess: Manages an unlit candle, changing its type to 338 (lit candle) when used or examined.",
  "0152": "Best guess: Manages a lit light source (e.g., candle), changing it to unlit (ID 336) when used, examined, or dropped, and handling equipping.",
  "0154": "Best guess: Manages portion items, applying various effects (e.g., poisoning, healing) based on frame, with warnings for misuse.",
  "0174": "Open shutters (type 1)",
  "0178": "Best guess: Manages a door interaction, toggling its state (open/closed) and updating its position and frame based on conditions.",
  "0179": "Best guess: Manages consumption of food items by mapping item frames to quantities and processing the item, likely for hunger or gameplay effects.",
  "017B": "Best guess: Displays various signs and messages based on item quality, ranging from location names to gravestones and warnings, used for world-building and navigation.",
  "0188": "Best guess: Manages another door interaction, similar to func_0178, toggling its state and updating position/frame with different parameters.",
  "018A": "Best guess: Manages a palace guard's dialogue, providing minimal responses about name and job, with random movement commands when idle, emphasizing authority.",
  "019A": "Best guess: Spawns items or objects based on item quality, likely for dynamic environmental or quest interactions, with specific coordinates and types.",
  "01A2": "Best guess: Spawns ammo (ID 581) near giant bones at a specific time, likely for a timed resource generation mechanic.",
  "01AF": "Best guess: Controls a bellows in a forge, animating it and heating a sword blank (ID 668) over a firepit (ID 739), adjusting frames based on position and state for a crafting sequence.",
  "01B0": "Best guess: Manages state-based interactions for an object (e.g., door or switch), changing its quality (30 or 31) based on a state variable, possibly for a puzzle or mechanism.",
  "01B1": "Best guess: Manages state-based interactions for an object (e.g., lever or switch), adjusting quality (30 or 31) based on state, likely part of a puzzle or mechanism.",
  "01B2": "Best guess: Handles a container or trap interaction, displaying a message (\"It is about time!\") and updating its state (e.g., opening a chest or triggering a trap) when activated.",
  "01B3": "Best guess: Changes an object’s shape (ID 481) and updates its state, possibly for a transformation or animation effect (e.g., a magical item or environmental object).",
  "01BF": "Best guess: Triggers a creature’s pain sound (“Arghh”) when interacted with, likely for a hostile or injured NPC or monster.",
  "01D6": "Best guess: Checks for and manipulates container contents (shape 810), possibly repositioning items or triggering an effect if empty.",
  "01DF": "Best guess: Manages an Emp NPC’s dialogue, greeting the player, discussing food preferences (fruits, milk, cheese), and handling honey offers, with gender-specific names.",
  "01E1": "Best guess: Initiates an object state change or interaction (linked to func_01B3), possibly for a chained mechanism or event trigger.",
  "01EF": "Best guess: Manages a cat NPC’s interaction, displaying a player taunt (“Here kitty, kitty”), a hostile reaction (“I hate cats”) if a specific NPC is in the party, or a meow sound.",
  "01F0": "Best guess: Manages a dog NPC’s interaction, displaying friendly barks (“Arf” or “Bark”) randomly or a greeting (“Good doggy”) when interacted with.",
  "01F4": "Best guess: Manages a cow NPC’s interaction, randomly displaying “Moo!” barks from party members or a single “Moo” when idle.",
  "01F7": "Best guess: Manages an NPC (likely a beggar or thief, ID 44) requesting a gold donation, hiding after receiving it or if conditions aren’t met.",
  "01F8": "Best guess: Manages a boss encounter with Dracothraxus (dragon NPC, ID 293), delivering dialogue based on the player’s inventory and battle outcome, with a courage test for a gem reward.",
  "01FA": "Best guess: Handles a dramatic scene with Batlin (NPC ID 26) reacting to Hook’s death, taunting the Avatar, and hiding, with flag checks for progression.",
  "020A": "Best guess: Indicates a locked chest, displaying a \"Locked\" message when interacted with, likely requiring a key or lockpick.",
  "020E": "Best guess: Checks proximity of a light source (type 440) to an item, transforming it (type 889) if conditions are met, likely for a light-based puzzle.",
  "0216": "Best guess: Handles interaction with a specific item, delegating to a specialized function for processing.",
  "0247": "Best guess: Manages a bedroll, deploying it as a bed (ID 1011) if there’s space, or reverting to item form when used or examined.",
  "0253": "Best guess: Manages a torch, changing its type to 701 (lit torch) when used or examined.",
  "0268": "Best guess: Applies a specific effect (ID 90) to an item, likely related to food or consumable mechanics.",
  "0269": "Best guess: Manages dialogue with the Time Lord, providing quest guidance based on flags and player choices.",
  "026F": "Best guess: Manages sword forging by hammering, checking heat levels (frame 8-15) and transforming the sword (type 991) if conditions are met, with failure messages.",
  "0270": "Best guess: Manages a pickaxe, mining resources from trees (ID 932) if held, with specific frame and position checks.",
  "0273": "Best guess: Manages a lockpick, unlocking chests or doors with a dexterity check, potentially breaking the pick or triggering traps.",
  "0275": "Best guess: Manages an item interaction, selecting a target and applying an effect with specific parameters.",
  "0276": "Best guess: Similar to func_0275, manages an item interaction with a target selection and effect application, with slight variations.",
  "0281": "Best guess: Manages a key, unlocking specific items (chests or doors) if quality matches, or relocking if already unlocked.",
  "0284": "Best guess: Simulates a coin toss game, allowing the player to call heads or tails and displaying the outcome.",
  "0285": "Best guess: Displays the exchange rate for a gold nugget (10 crowns) when the item is used.",
  "0286": "Best guess: Displays the exchange rate for a gold bar (100 crowns) when the item is used.",
  "0288": "Best guess: Manages a consumable item, applying an effect if used correctly or displaying an error if misused.",
  "0289": "Best guess: Boosts NPC stats (strength, dexterity, intelligence) when a consumable item is used on them.",
  "028A": "Best guess: Displays the player's coordinates as a compass direction (e.g., \"North East\"), failing if under a roof, likely for navigation.",
  "028B": "Best guess: Manages a spinning wheel, checking for wool (type 873) to produce thread (type 653), with a message if empty, and updating item frame randomly.",
  "028C": "Best guess: Triggers an action for a barge when event ID 1 is received, likely for transportation or movement mechanics.",
  "028D": "Best guess: Manages item pickup or interaction, checking container and player ownership, triggering specific actions (type 1581) if conditions are met.",
  "028E": "Best guess: Similar to func_028D, manages item pickup or interaction, checking container and player ownership, triggering different actions (type 1582).",
  "0291": "Curtains",
  "0292": "Best guess: Manages cooking dough into bread on a fire pit (ID 831), with a chance to burn if overcooked.",
  "0294": "Best guess: Handles generic use of an item, delegating to a specific function for processing.",
  "0296": "Best guess: Simulates fishing, with outcomes ranging from catching a fish to losing bait, based on random chance.",
  "029C": "Best guess: Manages sword interactions during forging, checking heat (frame 8-12) and position, updating frames or displaying failure messages, with specific event triggers.",
  "02A3": "Best guess: Manages a parrot NPC’s interaction, displaying various squawks, treasure hints, or party gold info based on its state or player actions.",
  "02A6": "Curtains",
  "02B1": "Best guess: Plays a specific music track (ID 57) when triggered, likely for an ambient or event-based sound effect.",
  "02B2": "Best guess: Plays a specific music track (ID 56) when triggered, likely for an ambient or event-based sound effect.",
  "02B3": "Best guess: Plays a specific music track (ID 58) when triggered, likely for an ambient or event-based sound effect.",
  "02B4": "Best guess: Plays a specific music track (ID 59) when triggered, likely for an ambient or event-based sound effect.",
  "02B5": "Best guess: Plays music (ID 55) and cycles NPC frames (ID 534) for an animation or event trigger.",
  "02B7": "Best guess: Calls an external function (ID 252) for an object interaction, possibly a clock or timer mechanism.",
  "02B8": "Best guess: Calls an external function (ID 0800H) for an object interaction, possibly a custom event or trigger.",
  "02BA": "Best guess: Handles a scissors interaction, converting them to bandages (shape 827) or displaying a suggestion to use them for cutting cloth.",
  "02BD": "Best guess: Manages a lit torch’s interaction, calling external functions to update its state or trigger effects, possibly for lighting or environmental changes.",
  "02BE": "Best guess: Manages a cannon’s interaction, checking for powder and cannonballs, displaying messages if missing, and firing based on direction.",
  "02C0": "Best guess: Manages a powder keg’s explosion or interaction, checking conditions and triggering an effect, likely for a destructive event.",
  "02C3": "Best guess: Triggers an external function (ID 1782) or updates an object (shape 990) with a state change, possibly for a puzzle or mechanism.",
  "02C4": "Open and close pillories",
  "02C5": "Best guess: Searches for objects (shape 734) and applies an external function (ID 734), possibly for a proximity-based effect or trigger.",
  "02CF": "Best guess: Repositions container items (shape 810) with specific offsets, likely for a puzzle or environmental effect.",
  "02D3": "Best guess: Manages an NPC (ID -1) advertising Iolo’s crossbow bolts, hiding after dialogue, likely a promotional easter egg.",
  "02D5": "Best guess: Simulates a gambling wheel interaction, prompting bets and cycling states, active outside 3 AM to 3 PM.",
  "02D8": "Best guess: Manages an NPC (ID -2, likely Spark) commenting on needing a blacksmith, possibly for a quest-related item.",
  "02D9": "Best guess: Updates an object’s state based on quality, possibly for a dynamic environmental effect or puzzle.",
  "02DA": "Best guess: Handles a child NPC interaction, prompting return to Lady Tory or commenting on party size, possibly for a quest.",
  "02DE": "Best guess: Manages an item’s frame and quality based on an event, likely for an environmental or interactive object, adding items to a container based on frame state.",
  "02DF": "Best guess: Displays a message suggesting training items are for trainers, likely for a practice area interaction.",
  "02E3": "Best guess: Empty or placeholder function, possibly a stub or disabled script.",
  "02E4": "Best guess: Repositions container items (shape 810) and spawns a new object (ID 470) if empty, likely for a puzzle or trap.",
  "02E5": "Best guess: Repositions container items (shape 810) with specific offsets, likely for a puzzle or environmental effect.",
  "02E6": "Best guess: Triggers an NPC (ID -2, likely Spark) to comment on an item’s neatness, possibly for a quest or easter egg.",
  "02E7": "Best guess: Manages a dragon encounter, rewarding the Avatar with a win message and triggering state changes, possibly for a quest.",
  "02E8": "Best guess: Executes an external function with large parameters, possibly for a rare event or system check.",
  "02E9": "Best guess: Plays a specific music track (ID 58) when triggered, likely for an ambient or event-based sound effect.",
  "02EB": "Best guess: Manages a soul cage’s interaction with a liche (ID 519), setting it up when the liche is sleeping, part of a quest.",
  "02F0": "Best guess: Toggles a music box to play music (ID 41) or stop (ID 255), setting a flag and calling an external function, likely for ambiance.",
  "02F2": "Best guess: Manages a soul cage’s transformation of a liche into Horance’s ghost, displaying a narrative message, part of a quest.",
  "02F5": "Best guess: Calls an external function (ID 0809H) for an object interaction, possibly a custom trigger or event.",
  "02F8": "Best guess: Manages a gem’s interaction, offering sale advice, mirror-breaking instructions, or triggering quest-related events.",
  "02FB": "Best guess: Triggers an NPC schedule change and external function outside 3 AM to 3 PM, possibly for a timed event.",
  "0301": "Best guess: Manages a smokebomb, creating a smoke effect at the player’s location and affecting nearby NPCs.",
  "0302": "Best guess: Triggers a special effect when an item is used under specific conditions, likely for a dramatic event.",
  "0303": "Best guess: Handles a wand’s interaction with specific items (e.g., Black Gate, ID 305) or NPCs (e.g., Batlin, ID 403), triggering effects or dialogue.",
  "0305": "Best guess: Handles generic use of an item, delegating to a specific function for processing.",
  "0306": "Best guess: Handles generic use of an item, delegating to a specific function for processing.",
  "030D": "Best guess: Manages ship gangplank interactions, checking sail state and obstructions, displaying appropriate messages.",
  "030E": "Best guess: Handles weapon attacks, prompting the player to attack with it and managing item transformations or actions based on selections.",
  "0311": "Best guess: Manages the Orb of the Moons, creating a moongate for teleportation if conditions (e.g., flag 57) are met, with specific positioning logic.",
  "0313": "Best guess: Manages an item’s interaction, likely a switch or lever, toggling its state and applying effects.",
  "0314": "Best guess: Manages a lever or switch, toggling its frame and applying effects to nearby items (e.g., IDs 870, 515) if quality matches.",
  "0316": "Best guess: Manages a consumable item, applying an effect if used correctly or displaying an error if misused.",
  "031C": "Best guess: Triggers an action for an item when event ID 1 is received, likely for a generic interactable object.",
  "031E": "Best guess: Changes an item’s type to 799 and sets its frame to 14 when event ID 1 is received, likely for a transformation or state change.",
  "0326": "Best guess: Manages dialogue with a Trinsic guard, requiring a password (Blackbird) to pass, with quest-related flag checks.",
  "0329": "Best guess: Simulates a roulette game, checking time and casino state to determine outcomes and trigger effects.",
  "032A": "Best guess: Manages bucket interactions, handling water usage for drinking, filling troughs, dousing fires, and other actions, with appropriate messages.",
  "0334": "Best guess: Manages a plaque, displaying text based on its quality ID (0-65), with specific messages for various locations or events.",
  "0336": "Best guess: Manages a diaper item, changing its state (clean, used, dirty) when applied to specific items (e.g., baby, ID 730).",
  "0337": "Best guess: Manages a paintbrush, allowing painting on specific items (e.g., canvas, ID 837) with pigments, with random feedback messages.",
  "033B": "Best guess: Applies bandages to NPCs, checking health status and displaying healing messages or rejection if unnecessary or invalid.",
  "033C": "Best guess: Triggers an action for an item with quality 0 when event ID is not 1, likely for a specific item interaction.",
  "0345": "Best guess: Displays a message instructing the player to use a brush and pigments, personalized with the player’s name.",
  "0347": "Best guess: Triggers a dialogue with the Time Lord (func_0269) when an hourglass is used, if specific conditions (flag 4) are met.",
  "0348": "Best guess: Manages a flying carpet, allowing the player to sit/stand and move, with a check for safe landing.",
  "034A": "Best guess: Activates an item action (type 91) when its frame is 4, likely for a switch or trigger mechanism.",
  "034D": "Best guess: Triggers an action for an item with quality 0 when event ID is not 1, likely for another specific item interaction.",
  "0350": "Best guess: Manages a quest item, triggering specific effects when used in a particular state (frame 3), setting a flag for quest progression.",
  "0353": "Best guess: Displays a message describing fine cloth, suggesting it could be sold in Minoc or cut into bandages.",
  "0356": "Best guess: Manages interaction with the Shrines of Truth, Love, and Courage, providing dialogue and boons based on quest progress and flags.",
  "035F": "Best guess: Handles flour-related interactions, checking item frame and type, applying effects, and displaying messages.",
  "0369": "Best guess: Triggers an effect for a specific item when used, checking ownership to ensure valid interaction.",
  "036C": "Best guess: Changes an item’s type to 876 on event ID 2 and triggers another action on event ID 1.",
  "0378": "Best guess: Manages a sextant, checking nearby items and triggering a quest event if conditions (e.g., flag 407) are met.",
  "0379": "Best guess: Manages a lamppost, toggling its state (on/off) and changing its type if specific conditions are met.",
  "037D": "Best guess: Modifies item properties based on quality and event ID, applying random or specific effects.",
  "03A7": "Best guess: Changes an object’s shape (ID 935) on use or calls an external function (ID 876), possibly for a quest item or mechanism.",
  "03A8": "Best guess: Changes an object’s shape (ID 936) on use or calls an external function (ID 303), possibly for a quest item or mechanism.",
  "03B0": "Best guess: Triggers an NPC (ID 356) to spit and react, possibly a humorous or environmental interaction.",
  "03B2": "Best guess: Manages a guard NPC’s dialogue, responding gruffly to name and job queries, likely for immersion or quest interaction.",
  "03B5": "Best guess: Calls an external function (ID 083EH) for a winch interaction, possibly for a mechanical or environmental effect.",
  "03B6": "Best guess: Calls an external function (ID 083EH) for a winch interaction, possibly for a mechanical or environmental effect.",
  "03C8": "Best guess: Triggers different external functions based on an object’s frame, possibly for a multi-state mechanism or trap.",
  "03D5": "Best guess: Aligns an object (shape 577) with another’s frame and position, possibly for a puzzle or placement mechanic.",
  "03DB": "Best guess: Spawns a screaming creature (ID 992) with a chance to cry out, possibly for a trap or ambush.",
  "03DE": "Best guess: Triggers a telepathic probe with narrative messages, hiding the NPC and altering game state, likely for a mystical quest event.",
  "03DF": "Best guess: Checks for a sword blank (ID 668) in a specific position and triggers an external function (ID 623), likely for a crafting quest.",
  "03E0": "Best guess: Animates an object with a sequence of frames, likely for a decorative or interactive effect.",
  "03F3": "Best guess: Calls an external function (ID 0800H) for a vertical bed interaction, possibly for a rest or animation mechanic.",
  "03F5": "Best guess: Animates an object with a sequence of frames, likely for a decorative or interactive effect.",
  "03F7": "Best guess: Manages a golem’s dialogue in Moonglow, seeking a book or aiding a fallen golem, part of a quest.",
  "03FD": "Best guess: Calls an external function (ID 617) for a specific NPC (ID 617), possibly for a quest or event trigger.",
  "0401": "Best guess: Handles dialogue with Iolo in Trinsic, discussing the murder, companions, and quest progression, with options to join or leave.",
  "0402": "Best guess: Handles dialogue with Spark in Trinsic, discussing his father’s murder, clues, and his desire to join the party to seek justice.",
  "0403": "Best guess: Handles dialogue with Shamino in Britain, discussing his life, companions, and the pocketwatch, with options to join or leave.",
  "0404": "Best guess: Handles dialogue with Dupre in Jhelom, discussing his knighthood, local duelling, and party dynamics, with options to join or leave.",
  "0405": "Best guess: Handles dialogue with Jaana in Cove, discussing her role as a healer, magic issues, and relationship with Lord Heather, with options to join or heal.",
  "0406": "Best guess: Handles dialogue with Trellek the Emp, discussing his role, family, and a whistle to talk to wisps, with conditions for joining.",
  "0407": "Best guess: Handles dialogue with Sentri in Britain, discussing his role as a combat trainer, with options to join, train, or leave.",
  "0408": "Best guess: Handles dialogue with Julia in Minoc, discussing her role as a tinker, murders, and Owen’s monument, with options to join or leave.",
  "0409": "Best guess: Handles dialogue with Katrina in New Magincia, discussing her life as a shepherd, local visitors, and a locket given to Henry, with options to join or leave.",
  "040A": "Best guess: Manages Tseramed’s dialogue, handling introductions, Fellowship opinions, and forest-related topics, with flag-based progression.",
  "040B": "Best guess: Manages Petre’s dialogue, covering the Trinsic murder, stables, and horse sales, with flag-based progression.",
  "040C": "Best guess: Manages Finnigan’s dialogue, overseeing the Trinsic murder investigation, password, and town details, with flag-based progression.",
  "040D": "Best guess: Manages Gilberto’s dialogue, discussing the Trinsic murder, his attack, and dock duties, with password verification.",
  "040E": "Best guess: Manages Johnson’s dialogue, handling dock duties, Fellowship membership, and password verification for Trinsic.",
  "040F": "Best guess: Manages Eiko’s dialogue, discussing her quest for vengeance against Iskander Ironheart, with flag-based progression.",
  "0410": "Best guess: Handles dialogue with Klog, the Trinsic Fellowship leader, discussing the Fellowship, a local murder, and suspicious activities revealed by the Cube, with investigative options.",
  "0411": "Best guess: Handles dialogue with Chantu, the Trinsic healer, discussing his services, the Fellowship, and the local murder, with healing options.",
  "0412": "Best guess: Handles dialogue with Dell, the Trinsic shopkeeper, discussing his shop, the Fellowship, and the local murder, with options to buy items during business hours.",
  "0413": "Best guess: Handles dialogue with Apollonia, the Trinsic innkeeper, discussing her pub and inn services, the local murder, and flirtatious interactions, with options to buy food, drink, or a room.",
  "0414": "Best guess: Handles dialogue with Markus, the Trinsic trainer, discussing his combat training services and the local murder, with training options during business hours.",
  "0415": "Best guess: Handles dialogue with Gargan, the Trinsic shipwright, discussing ship and sextant purchases, the local murder, and sightings of Hook and the Crown Jewel.",
  "0416": "Best guess: Handles dialogue with Caroline, a Fellowship recruiter in Trinsic, discussing her role and the local murder, with invitations to Fellowship meetings.",
  "0417": "Best guess: Handles dialogue with Lord British, discussing Britannia’s state, magic issues, the Trinsic murder, and quests involving the Isle of Fire, Rudyom, and Weston, with healing and equipment offers.",
  "0418": "Best guess: Handles dialogue with Nystul, the mage in Britain, discussing his faltering magic, Lord British, and spell/reagent sales, with signs of mental decline.",
  "0419": "Best guess: Handles dialogue with Chuckles, the court jester, who insists on playing “The Game” (a wordplay challenge), discussing topics like jokes, food, and girls if the player engages correctly.",
  "041A": "Best guess: Manages Batlin’s dialogue, handling Fellowship membership, package delivery, chest retrieval missions, and philosophical discussions, with flag-based progression and inventory checks.",
  "041B": "Best guess: Manages Raymundo’s dialogue, handling Royal Theatre operations, auditions for the Avatar role, and sponsorship requests, with flag-based progression.",
  "041C": "Best guess: Manages Jesse’s dialogue, discussing his role as the Avatar in the Royal Theatre’s play, his experimental works, and stage persona, with gender-based dialogue variations.",
  "041D": "Best guess: Manages Stuart’s dialogue, discussing his role as Iolo in the Royal Theatre’s play, his rivalry with Jesse, and his acting philosophy, with flag-based interactions involving Iolo.",
  "041E": "Best guess: Manages Amber’s dialogue, discussing her role as Sherry the Mouse, her relationship with Shamino, and her acting debut, with flag-based romantic interactions.",
  "041F": "Best guess: Manages Kristy’s dialogue, a toddler at an orphanage discussing her games and toys, with flag-based interactions involving another NPC.",
  "0420": "Best guess: Handles dialogue with Max, a toddler in the Royal Nursery, engaging in playful interactions like tag, singing, and a pacifier game.",
  "0421": "Best guess: Handles dialogue with Nicholas, a toddler in the Royal Nursery, engaging in tag and diaper-changing interactions, with Nanna’s commentary.",
  "0422": "Best guess: Handles dialogue with Nanna, the Royal Nursery caretaker, discussing her role, the children, and social issues like taxes and class structure, with Fellowship ties.",
  "0423": "Best guess: Handles dialogue with Csil, Britain’s healer, discussing his healing services, past as Abrams, and a theory on antibiotics, with tensions regarding the Fellowship.",
  "0424": "Best guess: Handles dialogue with Zella, a trainer in Britain specializing in boxing, discussing her combat philosophy and offering training for 45 gold.",
  "0425": "Best guess: Handles dialogue with Lucy, the Blue Boar tavern owner, offering food and drink, discussing the tavern’s history, and engaging playfully with the Avatar and Dupre.",
  "0426": "Best guess: Handles dialogue with Greg, the Provisioner’s Shop owner, discussing his shop’s history, lucky provisions, and a story about Gorn, with suspicions about a fake Avatar.",
  "0427": "Best guess: Handles dialogue with Neno, an ambitious bard and member of The Avatars, boasting about his talent and aspirations to perform solo and tour Britannia.",
  "0428": "Best guess: Handles dialogue with Judith, a music teacher and member of The Avatars, discussing her teaching, performances, and strained marriage to Patterson, the mayor.",
  "0429": "Best guess: Handles dialogue with Candice, the Royal Museum curator, discussing exhibits, Avatar artifacts, and her involvement with The Fellowship, hinting at a secret affair with the Mayor.",
  "042A": "Best guess: Manages Cynthia’s dialogue, handling Mint operations, tax council duties, gold exchange, and personal concerns about her husband James, with flag-based progression and inventory checks.",
  "042B": "Best guess: Manages Patterson’s dialogue, covering his role as Britain’s Mayor, his involvement with The Fellowship, and his affair with Candice, with flag-based progression and interactions involving Iolo and Judith.",
  "042C": "Best guess: Manages Carrocio’s dialogue, handling his puppet show, strength test, and personal life with Nell, with poetic responses and flag-based secrecy about Nell’s pregnancy.",
  "042D": "Best guess: Manages Figg’s dialogue, discussing his role as caretaker of the Royal Orchards, his Fellowship membership, and his accusations against Weston, with flag-based apple transactions.",
  "042E": "Best guess: Manages James’s dialogue, discussing his role as innkeeper at the Wayfarer’s Inn, his marital issues with Cynthia, and his pirate aspirations, with flag-based room transactions and a loop for party members.",
  "042F": "Best guess: Manages Jeanette’s dialogue, handling her role as a tavern wench at the Blue Boar, her romantic interests, and interactions with Dupre, with flag-based progression and corrections about Charles’s social status.",
  "0430": "Best guess: Handles dialogue with Amanda, a warrior seeking vengeance for her father's death by a cyclops, discussing her quest with her half-sister Eiko and their search for inner peace.",
  "0431": "Best guess: Handles dialogue with Denby, a trainer specializing in combat with minor magical effects, offering training for 75 gold and advocating for peace despite his fighter skills.",
  "0432": "Best guess: Handles dialogue with Fred, a farmer at the Farmer's Market, selling meats and discussing the slaughterhouse in Paws run by Morfin, a merchant from Buccaneer's Den.",
  "0433": "Best guess: Handles dialogue with Kelly, a farmer's wife at the Farmer's Market, discussing her husband Fred, their produce, and local farmers Brownie and Mack.",
  "0434": "Best guess: Handles dialogue with Willy, a baker in Britain, discussing his bread, secret recipes, and romantic interests (Jeanette and Gaye), offering to buy flour or hire the player to make bread.",
  "0435": "Best guess: Handles dialogue with Gaye, the clothier in Britain, discussing her shop, Fellowship involvement, and relationship with Willy, offering Avatar costumes and clothing for sale.",
  "0436": "Best guess: Handles dialogue with Coop, manager of Iolo’s Bows and member of The Avatars, discussing his shop, archery aspirations, and performances, with special interactions when Iolo is present.",
  "0437": "Best guess: Handles dialogue with Grayson, an armour and weapons merchant in Britain, discussing his shop and how The Fellowship transformed his business success, offering to sell armour and weapons.",
  "0438": "Best guess: Handles dialogue with Diane, who manages the stables in Britain, selling horses and carriages, and discussing her friends (Greg, James, Brownie, Mack) and the Fellowship.",
  "0439": "Best guess: Handles dialogue with Clint, a former sailor and shipwright in Britain, selling ship deeds and sextants, expressing disdain for the Fellowship and a tamed world.",
  "043A": "Best guess: Manages Gordon’s dialogue, handling his fish and chips business, Fellowship membership, and aspirations to visit Buccaneer’s Den, with flag-based transactions and random vendor calls.",
  "043B": "Best guess: Manages Sean’s dialogue, handling his jewelry business, Fellowship involvement, and gem transactions, with flag-based progression and complex gem validation loops.",
  "043C": "Best guess: Manages Brownie’s dialogue, discussing his farming life, failed mayoral campaign, and need for help with pumpkins, with flag-based job offers and loops for setting up farm tasks.",
  "043D": "Best guess: Manages Mack’s dialogue, discussing his farming, extraterrestrial encounters, and need for help with chicken eggs, with flag-based job offers and an elaborate tale of a tigerlion and enchanted hoe.",
  "043E": "Best guess: Manages Snaz’s dialogue, a beggar who tells jokes for gold coins, covering topics like The Fellowship, Lord British, and Weston, with flag-based progression and inventory checks for payments.",
  "043F": "Best guess: Manages Millie’s dialogue, a Fellowship recruiter discussing the organization, her brother Thad, and the Meditation Retreat, with flag-based progression and random Fellowship slogans.",
  "0440": "Best guess: Handles dialogue with Geoffrey, Captain of the Guard and Lord British’s bodyguard, discussing his role, past adventures, and advice on gaining experience, with comments on Nystul’s mental state.",
  "0441": "Best guess: Handles dialogue with Wislem, a gargoyle advisor to Lord British, discussing gargoyle integration into Britannian society and the murder of Inamo in Trinsic, urging the player to inform Draxinusom.",
  "0442": "Best guess: Handles dialogue with Sherry the Mouse, who assists in the Royal Nursery, plays with children, and searches for cheese, offering to recite \"Hubert's Hair-Raising Adventure\" and accepting cheese from the player.",
  "0443": "Best guess: Handles dialogue with Boots, Lord British’s personal cook, discussing her meals, her husband Bennie’s forgetfulness, and a shortage of mutton, offering to pay for mutton deliveries.",
  "0444": "Best guess: Handles dialogue with Bennie, Head Servant at Lord British’s castle, serving meals and discussing his family’s service, with comments on his absent-mindedness.",
  "0445": "Best guess: Handles dialogue with Weston, a prisoner in Britain’s jail, discussing his theft of apples, poverty in Paws, and social inequities, asking the player to appeal to Lord British for his release.",
  "0446": "Best guess: Handles dialogue with Miranda, a Great Council member, discussing women’s rights, her son Max, and a bill to protect Lock Lake, asking the player to deliver it to Lord Heather in Cove for signing.",
  "0447": "Best guess: Handles dialogue with Inwisloklem, a gargoyle on the Great Council, discussing gargoyle heritage, integration efforts, and the Fellowship, with references to Miranda’s work on a new law.",
  "0448": "Best guess: Handles dialogue with Nell, a chambermaid at Lord British’s castle, discussing her family, fiance Carrocio, and her secret pregnancy, with trust-based dialogue depending on the player’s identity.",
  "0449": "Best guess: Handles dialogue with Charles, a servant in Lord British’s castle, discussing his family, unrequited love for Jeanette, and Nell’s engagement, offering wine and reacting to news about Jeanette and Nell’s pregnancy.",
  "044A": "Best guess: Manages Rudyom’s dialogue, a senile mage discussing his failing magic, blackrock experiments, and a lost flying carpet, with flag-based spell and reagent transactions.",
  "044B": "Best guess: Manages Nastassia’s dialogue, a woman tending the Shrine of Compassion, discussing her family history, her parents’ tragic past, and a romantic subplot with the Avatar, with flag-based progression and gender-specific interactions.",
  "044C": "Best guess: Manages Rayburt’s dialogue, a combat trainer specializing in meditation, discussing his dog Regal and his wife Pamela, with flag-based training sessions and business hour checks.",
  "044D": "Best guess: Manages Lord Heather’s dialogue, the Mayor of Cove, discussing the town, its romantic atmosphere, Nastassia’s melancholy, and a bill to address Lock Lake’s pollution, with flag-based interactions and companion dialogues.",
  "044E": "Best guess: Manages Pamela’s dialogue, the innkeeper at the Out’n’Inn in Cove, discussing her business, her affection for Rayburt and his dog Regal, and room rentals, with flag-based transactions and a loop for party member pricing.",
  "044F": "Best guess: Manages Zinaida’s dialogue, the owner of The Emerald in Cove, discussing her tavern, her love for De Maria, and the polluted Lock Lake, with flag-based food and drink transactions.",
  "0450": "Best guess: Handles dialogue with De Maria, a bard in Cove, who sings tales about the townsfolk, particularly Nastassia and his love Zinaida, offering to perform a song or tale about Cove’s people.",
  "0451": "Best guess: Handles dialogue with Elynor, head counselor of the Fellowship in Minoc, discussing the Fellowship, local murders, and a package delivery quest, with reactions to the player’s actions and knowledge about Owen and the candelabra.",
  "0452": "Best guess: Handles dialogue with Gregor, head of the Minoc Fellowship and Britannian Mining Company, discussing Minoc’s trade, social changes, and the murders, with interruptions during Fellowship meetings or private moments with Elynor.",
  "0453": "Best guess: Handles dialogue with Margareta, a gypsy fortune-teller in Minoc, discussing the murders of Frederico and Tania, her husband Jergi, and Sasha’s involvement with the Fellowship, warning about its true nature.",
  "0454": "Best guess: Handles dialogue with Sasha, a young gypsy in Minoc grieving his murdered parents, Frederico and Tania, discussing his Fellowship membership, gypsy heritage, and family (Margareta and Jergi).",
  "0455": "Best guess: Handles dialogue with Gladstone, a glassblower and sculptor in Minoc’s Artist’s Guild, discussing the Guild’s struggles, Owen’s monument, the Fellowship, and the murders of Frederico and Tania.",
  "0456": "Best guess: Handles dialogue with Xanthia, a candelabra maker in Minoc’s Artist’s Guild, discussing her work for the Fellowship, the murders of Frederico and Tania, and the Guild’s challenges, with a focus on the candelabra found at the murder site.",
  "0457": "Best guess: Handles dialogue with Zorn, Minoc’s blacksmith, discussing his weapons and armour, the murders, Owen’s monument, and crafting helmets from Caddellite to block the cube generator’s sound.",
  "0458": "Best guess: Handles dialogue with Seara, a clockmaker in Minoc’s Artist’s Guild, discussing the Guild, the murders of Frederico and Tania, Sasha’s involvement with the Fellowship, and the controversy over Owen’s monument.",
  "0459": "Best guess: Handles dialogue with Karl, a reclusive mountain man near Minoc, discussing his disdain for Minoc, the Fellowship, Owen’s monument, the murders, and his brother’s death due to Owen’s faulty ship designs, offering Owen’s stolen plans to investigate with Julia.",
  "045A": "Best guess: Manages Owen’s dialogue, a boastful shipwright in Minoc, discussing his career, Fellowship-inspired voices, and a monument in his honor, with flag-based transactions for ships, sextants, and books, and a dramatic death scene after learning of ship failures.",
  "045B": "Best guess: Manages Burnside’s dialogue, the Mayor of Minoc, discussing the town’s commerce, Fellowship membership, Owen’s flawed monument plans, and local murders, with flag-based progression and a secret about his skepticism toward The Fellowship.",
  "045C": "Best guess: Manages Rutherford’s dialogue, a one-armed barkeep in Minoc, discussing local murders, the Crown Jewel, Hook, and the Fellowship, with flag-based room rentals and a loop for party member pricing.",
  "045D": "Best guess: Manages William’s dialogue, a sawmill worker in Minoc, discussing the gruesome murders he discovered, his Fellowship membership, and Owen’s monument, with flag-based progression and philosophy triggers.",
  "045E": "Best guess: Manages Karenna’s dialogue, a combat trainer in Minoc, discussing local murders, her colleague Jakher, and the gypsies, with flag-based training sessions and companion interactions.",
  "045F": "Best guess: Manages Jakher’s dialogue, a combat trainer in Minoc, discussing local murders, his colleague Karenna, Owen’s past, and the gypsies, with flag-based training sessions and companion interactions.",
  "0460": "Best guess: Handles dialogue with Jergi, the King of the Gypsies in Minoc, discussing the gypsies’ persecution, the murders of his brother Frederico and sister-in-law Tania, Sasha’s involvement with the Fellowship, and his wife Margareta’s foresight.",
  "0461": "Best guess: Handles dialogue with Mikos, the foreman of the Minoc mine, discussing the mine’s operations, machinery, miners (Owings, Malloy, and Fodus), and reacting defensively to mentions of the “silver fluid” Fodus referenced.",
  "0462": "Best guess: Handles dialogue with Saralek, an Emp female in the Silverleaf tree, discussing her family, Trellek's desire to join the party, and the need for Salamon's permission. Includes a wisps whistle suggestion.",
  "0463": "Best guess: Handles dialogue with Fodus, a sick gargoyle miner in the Minoc mine, discussing his job, the “secret ore” (blackrock), and his need for “silver fluid” (possibly venom), revealing delirious insights into mine operations.",
  "0464": "Best guess: Handles dialogue with Tavenor, an Emp in Yew, discussing Emp lifestyle (food, Silverleaf trees), their aversion to violence, and addressing human destruction of the forest, urging the player to stop cutting Silverleaf trees.",
  "0465": "Best guess: Handles dialogue with Salamon, a wise Emp leader in Yew, discussing Emp dietary habits, Silverleaf tree homes, and a contract to stop a woodcutter from cutting down Silverleaf trees, with Trellek’s involvement requiring player action.",
  "0466": "Best guess: Handles dialogue with Nicodemus, a quirky mage in Yew, discussing his failing magic, selling potions, reagents, and spells, and enchanting an hourglass for the Time Lord, with references to Knight’s Bridge games.",
  "0467": "Best guess: Handles dialogue with Thad, a zealous warrior in Yew, who is hostile to Fellowship members, discussing his quest to destroy the Fellowship, save his enchanted sister Millie, and his knowledge of Yew’s hunters.",
  "0468": "Best guess: Handles dialogue with Bradman, an archer trainer in Yew, discussing his training services, love for the forest, admiration for archers Iolo and Tseramed, and his friend Penni’s lack of hunting skill.",
  "0469": "Best guess: Handles dialogue with Sir Jeff, the High Court official at Yew’s Abbey prison, discussing his judicial role, the prisoners (a pirate and a troll), and his distrust of the jailer Goth.",
  "046A": "Best guess: Manages Tiery’s dialogue, a quirky gravedigger at Empath Abbey, discussing his job, the graveyard, and local residents, with flag-based progression and humorous misunderstandings of names like “Umpeth Abby” and “Barry.”",
  "046B": "Best guess: Manages Iskander’s dialogue, a cyclops hero in a dungeon, discussing his tribe, heroic past, and a tetrahedron riddle, with flag-based interactions and name-based responses.",
  "046C": "Best guess: Manages Reyna’s dialogue, a healer near Empath Abbey, discussing her mother’s grave, healing services, and local figures, with flag-based flower offerings and emergency healing checks using a loop.",
  "046D": "Best guess: Manages Brother Wayne’s dialogue, a lost monk from Empath Abbey, discussing his disorientation, studies with Taylor, and Aimi’s garden, with flag-based progression and nature-related topics.",
  "046E": "Best guess: Manages Garok Al-Mat’s dialogue, a mage lost in a dungeon, discussing his failing magic, a voice in his head, and his search for the Tetrahedron Generator, with flag-based reagent offerings and teleportation.",
  "046F": "Best guess: Manages Gharl’s dialogue, a troll prisoner, discussing his life of hunting and eating, now limited to sleeping in jail, with a flag-based food offering that reveals a secret about a troll ally.",
  "0470": "Best guess: Handles dialogue with D’Rel, a prisoner in Yew’s Abbey prison, discussing his incarceration for tax evasion, his disdain for the Britannian Tax Council, Sir Jeff, and Goth, and his connection to Hook from Buccaneer’s Den.",
  "0471": "Best guess: Handles dialogue with Smith, a talking horse in Yew, who humorously discusses his lack of a job, interior decorating skills, and provides a cryptic clue about gargoyles and Rasputin in exchange for being left alone.",
  "0472": "Best guess: Handles dialogue with Aimi, a monk at Yew’s Abbey, discussing her gardening, painting, and winemaking, offering flower bouquets for sale or as a gift for Reyna’s loss, and directing the player to Taylor for local knowledge.",
  "0473": "Best guess: Handles dialogue with Penni, a spear-wielding trainer in Yew, discussing her combat training, love for hunting, friendship with Bradman, and concern for her husband Addom’s safety.",
  "0474": "Best guess: Handles dialogue with Ben, a logger in Yew, discussing his family’s logging tradition, the forest, and his agreement to stop cutting Silverleaf trees for the Emps by signing a contract.",
  "0475": "Best guess: Handles dialogue with Goth, the untrustworthy jailer at Yew’s Empath Abbey prison, offering information about prisoners (D’Rel and a troll) and selling cell keys for gold, with a sneering demeanor.",
  "0476": "Best guess: Handles dialogue with Carlyn, the tailor and part-time bartender in Moonglow, discussing her sewing, serving food and drink at the Friendly Knave, and the local Fellowship branch led by Rankin.",
  "0477": "Best guess: Handles dialogue with Master De Snel, the leader of Jhelom’s Library of Scars, discussing his fighting school, a dagger linked to Minoc murders, and disputes over the honor flag involving Sprellic.",
  "0478": "Best guess: Handles dialogue with Joseph, the mayor of Jhelom, discussing the town’s duelling culture, the Library of Scars, the Fellowship’s potential branch, and his neutral stance on Sprellic’s dispute.",
  "0479": "Best guess: Handles dialogue with Kliftin, Jhelom’s Armoury master, discussing his soldier past, selling weapons and armour, and crafting a duplicate honor flag to save Sprellic from a duel with the Library of Scars.",
  "047A": "Best guess: Manages Ophelia’s dialogue, a barmaid at The Bunk and Stool in Jhelom, discussing her job, Sprellic’s duels, and betting, with flag-based interactions, room rentals, and banter with Daphne.",
  "047B": "Best guess: Manages Daphne’s dialogue, a barmaid at The Bunk and Stool in Jhelom, discussing her overworked role, Sprellic’s troubles, and betting against him, with flag-based interactions and banter with Ophelia.",
  "047C": "Best guess: Manages Sprellic’s dialogue, the timid innkeeper of The Bunk and Stool in Jhelom, discussing his predicament with stolen honor flag and impending duels, with flag-based resolutions and a detailed story.",
  "047D": "Best guess: Manages Vokes’s dialogue, a fighter at the Library of Scars in Jhelom, discussing his role, the honor flag theft, and duels with Sprellic, with flag-based combat triggers and banter with Syria.",
  "047E": "Best guess: Manages Syria’s dialogue, a fighter at the Library of Scars in Jhelom, discussing her role, the stolen honor flag, and duels with Sprellic, with flag-based flag return and combat triggers.",
  "047F": "Best guess: Manages Timmons’s dialogue, a new fighter in Jhelom seeking to prove himself to Master De Snel at the Library of Scars by dueling Sprellic over the stolen honor flag, with flag-based combat triggers.",
  "0480": "Best guess: Handles dialogue with Iriale Silvermist, a guard at the Meditation Retreat, enforcing the rule against entering a restricted cave, threatening combat, and reacting to mentions of Gorn.",
  "0481": "Best guess: Handles dialogue with Russell, a shipwright in New Magincia, selling ship deeds and sextants, and discussing a shipwreck involving three strangers, a locket, the Crown Jewel, and Hook.",
  "0482": "Best guess: Handles dialogue with Boris, the innkeeper of The Modest Damsel in New Magincia, managing Dupre’s bar tab, serving food, drinks, and rooms, and reluctantly addressing a stolen locket.",
  "0483": "Best guess: Handles dialogue with Magenta, the mayor of New Magincia, discussing her administrative duties, her husband Boris, and a locket she found, which may belong to someone else or be stolen.",
  "0484": "Best guess: Handles dialogue with Henry, a heartbroken peddler in New Magincia, discussing his lost locket meant for Constance, his childhood friend Katrina, and three strangers who may have taken it.",
  "0485": "Best guess: Handles dialogue with Constance, the waterbearer of New Magincia, discussing her job, heartbreak over Henry, and her interactions with three strangers (Robin, Battles, Leavell) who mislead her about Buccaneer’s Den.",
  "0486": "Best guess: Handles dialogue with Robin, a gambler stranded in New Magincia, discussing his gambling profession, his bodyguards Battles and Leavell, a lost locket, and a sinister plan to kidnap Constance for profit in Buccaneer’s Den.",
  "0487": "Best guess: Handles dialogue with Battles, a bodyguard for Robin in New Magincia, discussing his role, his partner Leavell, their employer Robin, and a locket seen with Robin before drinking at The Modest Damsel.",
  "0488": "Best guess: Handles dialogue with Leavell, a bodyguard for Robin in New Magincia, discussing his criminal past, his partner Battles, their employer Robin’s gambling, and a locket possibly held by Robin.",
  "0489": "Best guess: Handles dialogue with Sam, the Flower Man of New Magincia, discussing his flower-selling business, greenhouse studies, and observations about Henry's locket and the three strangers (Robin, Battles, Leavell). Includes a flower purchase transaction.",
  "048A": "Best guess: Manages Gorn’s dialogue, a warrior from Balema in a cave searching for Brom, guided by a voice in his head, with flag-based interactions involving Iriale and Fellowship-like philosophy, potentially ending in distrust.",
  "048C": "Best guess: Manages Markham’s dialogue, a ghostly barkeep at the Keg O’ Spirits in Skara Brae, discussing the town’s destruction, Horance’s control, and refusing to be a sacrifice, with flag-based interactions and banter with other ghosts.",
  "048D": "Best guess: Manages Horance’s dialogue, a powerful liche in Skara Brae plotting to rule Britannia with an undead army, discussing his plans, Rowena, and a mysterious ore, with flag-based warnings from companions.",
  "048E": "Best guess: Manages Trent’s dialogue, a ghostly blacksmith in Skara Brae crafting a Soul Cage to destroy Horance and free his wife Rowena, with flag-based interactions involving a ring and music box.",
  "048F": "Best guess: Manages Mordra’s dialogue, a ghostly healer and mage in Skara Brae, providing instructions to destroy Horance the Liche using a Soul Cage, with flag-based interactions about ingredients, the Well of Souls, and town history.",
  "0490": "Best guess: Handles dialogue with Rowena, a ghostly lady in Horance's tower on Skara Brae, discussing her role as mistress, her lord Horance (the Liche), and the tower's beauty. Includes conditional ghostly behavior based on player actions and time of day.",
  "0491": "Best guess: Handles dialogue with Paulette, a ghostly barmaid in the Keg O' Spirits tavern on Skara Brae, discussing her past job, the fire that killed her, and her flirtatious interactions. Includes refusal to be a sacrifice for the Well of Souls.",
  "0492": "Best guess: Handles dialogue with Quenton, a ghostly fisherman in Skara Brae's Keg O' Spirits tavern, discussing his tragic past, the fire that destroyed the town, and the Liche Horance's control. Includes refusal to be a sacrifice due to his daughter Marney's soul.",
  "0493": "Best guess: Handles dialogue with Mayor Forsythe, a cowardly ghost in Skara Brae, discussing the Liche Horance, the fire caused by Caine, and the plan to trap the Liche. Includes conditional sacrifice dialogue and leading Forsythe to the Well of Souls.",
  "0495": "Best guess: Handles dialogue with a three-headed hydra (Shandu, Shanda, Shando) guarding Caddellite in Ambrosia, discussing their names, role, and growing hostility toward the player.",
  "0496": "Best guess: Handles dialogue with Penumbra, a mage in Moonglow, discussing the disturbed ether, the need for blackrock to protect her, and the Ethereal Ring to destroy the Tetrahedron generator in Dungeon Deceit.",
  "0497": "Best guess: Handles dialogue with Kissme, a flirtatious fairy in Ambrosia, spreading love dust and discussing the island's history, Caddellite, and the hydra. Includes an option to accept a kiss.",
  "0498": "Best guess: Handles dialogue with Zelda, the Lycaeum advisor in Moonglow, discussing her role, the library, and her feelings for Brion and Nelson, including a romance quest.",
  "0499": "Best guess: Handles dialogue with Mariah, a mage at the Lycaeum in Moonglow, discussing her spell and potion sales, her disorientation, and her appreciation for the library's shelves and quills.",
  "049A": "Best guess: Manages Grod’s dialogue, a troll torturer in a dungeon, proudly discussing his job and Fellowship membership, offering the player a chance to torture prisoners, with flag-based interactions and prisoner banter.",
  "049B": "Best guess: Manages Cubolt’s dialogue, a farmer in Moonglow concerned about his brother Tolemac’s involvement with The Fellowship, discussing Morz’s stutter and local residents, with a flag-based reaction to the player’s Fellowship membership.",
  "049C": "Best guess: Manages Balayna’s dialogue, the Fellowship clerk in Moonglow, discussing her role, the organization’s tenets, and Rankin’s doubts, with a flag-based reaction to a poisoned liqueur and Fellowship membership checks.",
  "049D": "Best guess: Manages Tolemac’s dialogue, a Moonglow farmer and Fellowship member, discussing his farm, brother Cubolt, and friend Morz, with flag-based reactions to reconversion attempts and Fellowship membership.",
  "049E": "Best guess: Manages Morz’s dialogue, a shy farmer in Moonglow with a stutter, discussing his work with Cubolt and Tolemac, and his uncertainty about joining The Fellowship, with flag-based responses to joining or not.",
  "049F": "Best guess: Manages Jillian’s dialogue, a scholar and tutor in Moonglow, offering training sessions for 35 gold and discussing the town’s geography and the lost continent of Ambrosia, with flag-based responses to training availability.",
  "04A0": "Best guess: Manages Effrem’s dialogue in Moonglow, discussing his stay-at-home role and wife Jillian, with gender-specific responses.",
  "04A1": "Best guess: Manages Chad’s dialogue in Moonglow, offering light weapon training and town information, with humorous Avatar banter.",
  "04A2": "Best guess: Manages Elad’s dialogue in Moonglow, discussing his role as a healer, the community, and his desire to leave.",
  "04A3": "Best guess: Manages Phearcy’s dialogue in Moonglow, offering food/drink and gossip about townspeople, with a quest about Zelda and Brion.",
  "04A4": "Best guess: Manages Addom’s dialogue in Moonglow, discussing his travels, artifacts, and a crystal for sale.",
  "04A5": "Best guess: Manages Frank’s dialogue, a fox critiquing the player’s hygiene and companions, likely for humorous interaction.",
  "04A6": "Best guess: Manages Thurston’s dialogue in Paws, discussing the mill, a theft, and his feelings for Polly.",
  "04A7": "Best guess: Manages Feridwyn’s dialogue in Paws, discussing a snake venom theft, The Fellowship shelter, and townspeople, with a focus on Tobias and Garritt’s involvement.",
  "04A8": "Best guess: Manages dialogue with Brita, who runs the Fellowship shelter in Paws, covering her role, Feridwyn’s dedication, and the venom theft involving her son Garritt.",
  "04A9": "Best guess: Handles dialogue with Alina, a poor mother in the Fellowship shelter in Paws, discussing her husband Weston’s imprisonment, her daughter Cassie, and pressure to join the Fellowship.",
  "04AA": "Best guess: Manages dialogue with Merrick, a former farmer in Paws, covering his identity, the Fellowship, the venom theft, and local characters.",
  "04AB": "Best guess: Handles dialogue with Garritt, a young Fellowship member in Paws, covering his aspirations, family, and involvement in framing Tobias for venom theft, with playful taunts for eventid 0.",
  "04AC": "Best guess: Manages Morfin’s dialogue in Paws, a merchant running the slaughterhouse, discussing venom theft, his ledger, and meat sales.",
  "04AD": "Best guess: Manages Beverlea’s dialogue in Paws, an elderly shopkeeper selling antiques at the House of Items, with items like a cradle, lute, and sextant.",
  "04AE": "Best guess: Manages Komor’s dialogue in Paws, a bitter beggar discussing his past as a farmer, his friendship with Fenn, and disdain for The Fellowship.",
  "04AF": "Best guess: Manages Fenn’s dialogue in Paws, a beggar defending Tobias, criticizing The Fellowship, and discussing his past with Komor and Merrick.",
  "04B0": "Best guess: Manages Andrew’s dialogue in Paws, a dairy owner selling milk and cheese, providing clues about the venom theft and Morfin’s slaughterhouse.",
  "04B1": "Best guess: Manages Camille’s dialogue in Paws, a widowed farmer defending her son Tobias against theft accusations and selling carrots.",
  "04B2": "Best guess: Manages Tobias’s dialogue in Paws, a young boy accused of theft, defending his innocence and expressing distrust of The Fellowship.",
  "04B3": "Best guess: Manages Polly’s dialogue in Paws, the bartender at the Salty Dog, offering rooms and discussing local residents and the venom theft.",
  "04B4": "Best guess: Manages Draxinusom’s dialogue in Terfin, an aged gargoyle reflecting on his past, The Fellowship, and the loss of his Ethereal Ring.",
  "04B5": "Best guess: Manages Inforlem’s dialogue in Terfin, a gargoyle trainer and weapon seller, discussing local conflicts and residents.",
  "04B6": "Best guess: Manages Inmanilem’s dialogue in Terfin, a gargoyle healer providing information about the city and its residents.",
  "04B7": "Best guess: Manages Teregus’s dialogue in Terfin, a gargoyle caretaker of the altars, concerned about threats to them and Inamo’s fate.",
  "04B8": "Best guess: Manages Runeb’s dialogue in Terfin, a volatile Fellowship clerk with a sinister plot to destroy the altars and frame Quan.",
  "04B9": "Best guess: Manages Quan’s dialogue in Terfin, the Fellowship leader who is unaware of Runeb’s plot and promotes the group’s philosophy.",
  "04BA": "Best guess: Manages Quaeven’s dialogue in Terfin, a Fellowship member running the Recreation Facility and Learning Center, recruiting Betra.",
  "04BB": "Best guess: Manages Silamo’s dialogue in Terfin, a wingless gargoyle gardener frustrated by his social status and considering The Fellowship.",
  "04BC": "Best guess: Manages Sarpling’s dialogue in Terfin, a Fellowship-supporting shopkeeper fearful of Runeb’s altar destruction and assassination plot.",
  "04BD": "Best guess: Manages Forbrak’s dialogue in Terfin, a gargoyle tavernkeeper aware of local residents and conflicts between shrines and The Fellowship.",
  "04BE": "Best guess: Manages Betra’s dialogue in Terfin, a provisioner skeptical of The Fellowship and concerned about racial tensions.",
  "04BF": "Best guess: Manages Martingo’s dialogue in Spektran, a delusional sultan obsessed with his imaginary harem and secure vault containing the Ethereal Ring.",
  "04C0": "Best guess: Manages Menion’s dialogue in Serpent’s Hold, a trainer and swordsmith offering combat training and forging instructions.",
  "04C1": "Best guess: Manages Sir Pendaran’s dialogue in Serpent’s Hold, a knight who defaced Lord British’s statue due to disillusionment with Britannia’s government.",
  "04C2": "Best guess: Manages Lady Jehanne’s dialogue in Serpent’s Hold, a provisioner selling a ship and revealing Sir Pendaran’s statue defacement.",
  "04C3": "Best guess: Manages Lord John-Paul’s dialogue in Serpent’s Hold, the overseer investigating the defacement of Lord British’s statue.",
  "04C4": "Best guess: Manages Sir Richter’s dialogue in Serpent’s Hold, an armourer suspicious of Sir Horffe and involved in the statue defacement investigation.",
  "04C5": "Best guess: Manages Sir Horffe’s dialogue in Serpent’s Hold, a gargoyle captain revealing he was wounded trying to stop the statue vandal.",
  "04C6": "Best guess: Manages Sir Jordan’s dialogue in Serpent’s Hold, a blind knight running Iolo’s South and providing clues about the statue defacement.",
  "04C7": "Best guess: Manages Sir Denton’s dialogue in Serpent’s Hold, a tavernkeeper providing extensive information about residents and aiding the statue defacement investigation.",
  "04C8": "Best guess: Manages Lady Tory’s dialogue in Serpent’s Hold, a counselor sensing residents’ emotions and seeking her missing child, Riky.",
  "04C9": "Best guess: Manages Lady Leigh’s dialogue in Serpent’s Hold, a healer who examines statue fragments to identify gargoyle blood.",
  "04CA": "Best guess: Manages Ian’s dialogue at the Meditation Retreat, discussing Fellowship philosophy and providing a key to members.",
  "04CB": "Best guess: Manages Cador’s dialogue in Vesper, a mining overseer with mixed feelings about gargoyles and pride in The Fellowship.",
  "04CC": "Best guess: Manages Mara’s dialogue in Vesper, a miner expressing strong distrust of gargoyles and concerns about town safety.",
  "04CD": "Best guess: Manages Zaksam’s dialogue in Vesper, a trainer wary of gargoyles and suspicious of certain residents like Blorn.",
  "04CE": "Best guess: Manages Eldroth’s dialogue in Vesper, a provisioner and counselor offering quirky advice and insights on town residents.",
  "04CF": "Best guess: Manages Yongi’s dialogue in Vesper, a tavern keeper at the Gilded Lizard with strong anti-gargoyle sentiments.",
  "04D0": "Best guess: Manages Blorn’s dialogue in Vesper, a surly resident hostile to gargoyles, seeking revenge against Lap-Lem and involved in an amulet dispute.",
  "04D1": "Best guess: Manages Auston’s dialogue in Vesper, the mayor grappling with human-gargoyle tensions and Fellowship activities.",
  "04D2": "Best guess: Manages Liana’s dialogue in Vesper, the mayor’s clerk critical of certain residents and wary of gargoyles.",
  "04D3": "Best guess: Manages Lap-Lem’s dialogue in Vesper, a gargoyle miner facing racial tensions and seeking the return of a stolen amulet.",
  "04D4": "Best guess: Manages Yvella’s dialogue in Vesper, a concerned mother and Fellowship member worried about her daughter Catherine and distrustful of gargoyles.",
  "04D5": "Best guess: Manages Catherine’s dialogue in Vesper, a young girl who idolizes the Avatar and has secret interactions with a gargoyle, For-Lem.",
  "04D6": "Best guess: Manages For-Lem’s dialogue in Vesper, a gargoyle laborer preserving gargoyle legends and concerned about a human girl, Catherine.",
  "04D7": "Best guess: Manages Ansikart’s dialogue in Vesper, a gargoyle tavern keeper serving food and drink, aware of local gargoyle tensions.",
  "04D8": "Best guess: Manages Wis-Sur’s dialogue in Vesper, a paranoid gargoyle mage selling magical items, distrustful of humans.",
  "04D9": "Best guess: Manages Anmanivas’s dialogue in Vesper, a hostile gargoyle who may attack the player due to resentment toward humans.",
  "04DA": "Best guess: Manages Foranamo’s dialogue in Vesper, a hostile gargoyle who may attack the player due to resentment toward humans, often alongside Anmanivas.",
  "04DB": "Best guess: Manages Aurvidlem’s dialogue in Vesper, a gargoyle provisioner critical of Ansikart’s leadership and concerned about Wis-Sur’s change.",
  "04DC": "Best guess: Manages Sullivan’s dialogue in Buccaneer’s Den, a jailed Fellowship member who impersonated the Avatar, revealing insights about the organization.",
  "04DD": "Best guess: Manages Wench’s dialogue in Buccaneer’s Den, a worker at The Baths offering various services and revealing secrets about the area.",
  "04DE": "Best guess: Manages Glenno’s dialogue in Buccaneer’s Den, the manager of The Baths, handling entry fees and Fellowship perks, with special interactions for young Spark.",
  "04DF": "Best guess: Manages Martine’s dialogue in Buccaneer’s Den, a worker at The Baths offering various services and revealing secret passages.",
  "04E0": "Best guess: Manages Roberto’s dialogue in Buccaneer’s Den, a worker at The Baths offering services and revealing secret passages, with gender-specific interactions.",
  "04E1": "Best guess: Manages Sintag’s dialogue in Buccaneer’s Den, a tough guard at the House of Games who distrusts Avatars and provides information about Hook and a torture chamber.",
  "04E2": "Best guess: Manages Blacktooth’s dialogue in Buccaneer’s Den, a pirate distrustful of Avatars and Fellowship members, with emotional ties to his former friend Mole.",
  "04E3": "Best guess: Manages Mole’s dialogue in Buccaneer’s Den, a retired pirate reflecting on his past and Fellowship membership, with a focus on his strained relationship with Blacktooth.",
  "04E4": "Best guess: Manages Lucky’s dialogue in Buccaneer’s Den, a charismatic rogue offering training in deception and sharing insights on his worldly experiences.",
  "04E5": "Best guess: Manages Budo’s dialogue in Buccaneer’s Den, a cheerful merchant selling provisions, weapons, armor, and a ship deed, with ties to The Fellowship.",
  "04E6": "Best guess: Manages Gordy’s dialogue in Buccaneer’s Den, the overseer of the House of Games, handling gambling registration and revealing Fellowship backing, with suspicion toward Avatars.",
  "04E7": "Best guess: Manages Mandy’s dialogue in Buccaneer’s Den, the innkeeper of the Fallen Virgin, offering food, drink, and rooms, with gossip about locals and suspicions about Hook.",
  "04E8": "Best guess: Manages Smithy’s dialogue in Buccaneer’s Den, explaining the rules of games at the House of Games and warning against cheating.",
  "04E9": "Best guess: Manages Paul’s dialogue in Buccaneer’s Den, an actor organizing the Passion Play performance about The Fellowship, handling ticket sales and scheduling.",
  "04EA": "Best guess: Manages Meryl’s brief actress dialogue, displaying random promotional messages for the Passion Play when examined (event 0) or a focused actress message when spoken to (event 1).",
  "04EB": "Best guess: Manages an unnamed actor’s dialogue in Buccaneer’s Den, focused on preparing for the Passion Play, redirecting conversation to Paul.",
  "04EC": "Ellen's NPC number is 236 decimal, EC hex.",
  "04ED": "Best guess: Manages Kessler’s dialogue in Britain, an apothecary studying silver snake venom, offering to buy vials and sell potions, with warnings about venom’s dangers.",
  "04EE": "Best guess: Manages Perrin’s dialogue in Empath Abbey, a scholar offering training in knowledge and magic, studying undertakers like Tiery, and discussing local landmarks.",
  "04EF": "Best guess: Manages Owings’s dialogue in a mine, a clumsy miner working with Malloy, discussing helmets, cave-ins, and their comedic mishaps, with a focus on safety concerns.",
  "04F0": "Best guess: Manages Anton’s dialogue in a prison, a bitter prisoner accused of spying on The Fellowship, interacting with a troll and revealing his true feelings about the group.",
  "04F1": "Best guess: Manages Murray’s (Papa’s) dialogue in a cave, a seemingly wild man living with Mama, avoiding bees and revealing his true identity as a fugitive apothecary from Yew.",
  "04F2": "Best guess: Manages Taylor’s dialogue at the Brotherhood of the Rose monastery, studying local flora, fauna, and geography, discussing a lost monk and offering a smoke bomb for Bee Cave.",
  "04F3": "Best guess: Manages Malloy’s dialogue in a mine, a pompous miner working with Owings on a secret Britannian Mining Company tunnel project, misled by a fake map.",
  "04F4": "Best guess: Manages Cairbre’s dialogue in a cavern, a sell-sword accompanying Cosmo on a quest to find a unicorn, skeptical of Cosmo’s motives and Ophelia’s intentions.",
  "04F5": "Best guess: Manages Kreg’s dialogue at the Abbey, a monk posing as an alchemist but revealed as a thief planning to escape using a potion of invisibility.",
  "04F6": "Best guess: Manages Alagner’s dialogue in New Magincia, a sage investigating The Fellowship’s corruption, requiring proof of knowledge to lend his notebook.",
  "04F7": "Best guess: Manages Caine’s dialogue in Skara Brae, the Tortured One, a ghostly alchemist tormented by his failure to destroy the Liche, providing potion instructions and answers to life and death questions if freed.",
  "04F8": "Best guess: Manages Brion’s dialogue in Moonglow’s observatory, discussing the telescope, orrery, and Astronomical Alignment, offering an orrery viewer if a crystal is provided.",
  "04F9": "Best guess: Manages Nelson’s dialogue in Moonglow’s Lycaeum, discussing his assistant Zelda’s feelings, the North East sea, and showing off scholarly items.",
  "04FA": "Best guess: Manages Rankin’s dialogue in Moonglow, the Fellowship branch leader, addressing Balayna’s accusations, her death, and a suspicious liqueur vial.",
  "04FB": "Best guess: Manages Danag’s dialogue in Buccaneer’s Den, the interim Fellowship leader, revealing sinister Fellowship plans and executioner details when the Cube vibrates.",
  "04FC": "Best guess: Manages Kallibrus’s dialogue, a gargoyle warrior in a dungeon helping Cosmo find a unicorn to prove virginity, with Cairbre clarifying their friendship.",
  "04FD": "Best guess: Manages Cosmo’s dialogue, a naive warrior in a dungeon seeking a unicorn to prove his virginity to his betrothed, Ophelia, with companions mocking his quest.",
  "04FE": "Best guess: Manages Lasher’s dialogue, a unicorn in a dungeon who detects virgins, sharing his cursed history and reluctance to aid virginity tests, especially for Cosmo’s quest.",
  "04FF": "Best guess: Manages Myrtle’s (Mama’s) dialogue in Bee Cave, living with Murray (Papa), with a secret past revealed by Papa, reacting to the player and Spark’s presence.",
  "0500": "Best guess: Handles dialogue with a Wisp (Xorinia) for trading Alagner's notebook for information about the Time Lord and the Guardian's Black Gate.",
  "0501": "Best guess: Calls an external function to handle item interaction, possibly for a specific item or NPC action.",
  "0502": "Best guess: Calls an external function to handle item interaction, possibly for a specific item or NPC action.",
  "0506": "Best guess: Calls an external function to process an item action, possibly for a specific item or NPC behavior.",
  "0507": "Best guess: Calls an external function to process an item action, possibly for a specific item or NPC behavior.",
  "0508": "Best guess: Calls an external function to process an item action, possibly for a specific item or NPC behavior.",
  "0509": "Best guess: Calls an external function to process an item action, possibly for a specific item or NPC behavior.",
  "050A": "Best guess: Executes a single external function call, likely related to item or NPC interaction, with minimal logic, possibly for a specific event trigger or action in the game.",
  "050D": "Best guess: Executes a single external function call, likely related to item or NPC interaction, with minimal logic, possibly for a specific event trigger or action in the game.",
  "0600": "Best guess: Manipulates item type and quality, converting specific items (e.g., type 338 to 997) and adjusting quality.",
  "0603": "Best guess: Checks NPC properties and displays a message about health status, possibly adjusting NPC state.",
  "0606": "Best guess: Adjusts object position based on retrieved coordinates, possibly for dynamic movement or placement.",
  "0607": "Best guess: Increments an item counter, possibly for tracking usage or state.",
  "0608": "Best guess: Handles Fellowship ambush dialogue, with NPCs (Hook, Forskis, Abraham, Elizabeth) sentencing the Avatar to death, initiating combat.",
  "0609": "Best guess: Decrements an item counter, possibly for tracking usage or state.",
  "060A": "Best guess: Manages a gambling game mechanic, likely a slot machine or roulette, determining outcomes based on item frame colors (Blue, Black, White, etc.), calculating wins/losses, and updating game state with flag-based NPC dialogue.",
  "060B": "Best guess: Manages a game state check for an event (likely a race or competition), setting flags 31 and 32 based on conditions and calling an external function if both are set.",
  "060C": "Best guess: Manages a racing game mechanic, likely a horse race, checking lane outcomes, updating item frames, and awarding wins based on position comparisons, with NPC dialogue for results.",
  "060D": "Best guess: Manages a crafting or transformation mechanic, checking item quality and positions, updating item states, and potentially generating new items based on random outcomes.",
  "060E": "Best guess: Handles a resurrection mechanic, restoring party members or NPCs, playing music, and managing item states (e.g., containers, frames) with complex array-based animations and NPC property updates.",
  "060F": "Best guess: Triggers an endgame sequence, updating item properties, playing animations, and initiating the game’s conclusion, likely tied to a specific item or event.",
  "0610": "Best guess: Handles party member dialogue after the Avatar's recovery, discussing Fellowship members and celebrating survival.",
  "0611": "Best guess: Transforms an item's type (e.g., 515 to 870 or back) based on position data, possibly for dynamic object state changes.",
  "0612": "Best guess: Triggers an item effect, possibly for a specific action or event.",
  "0613": "Best guess: Updates party member states and clears item states, possibly for quest progression.",
  "0614": "Best guess: Handles a complex dialogue tree (states 1-29) with Guardian/Time Lord interactions, guiding the Avatar through choices.",
  "0615": "Best guess: Sets an item's type and frame when eventid is 2, likely for object state change or activation.",
  "0617": "Best guess: Handles dialogue and item manipulation for a quest item (possibly an hourglass), instructing the Avatar to take it to Mordra.",
  "0618": "Best guess: Initializes Avatar appearance via moongate, adding items to inventory and setting quest flags.",
  "0619": "Best guess: Destroys an item and sets a quest flag, possibly for quest cleanup.",
  "061A": "Best guess: Executes a single external function call, likely a simple trigger for a game event, mechanic, or cleanup, with minimal logic.",
  "061B": "Best guess: Manages a generator mechanic in the Despise dungeon, updating its state and triggering an event or object (ID 617) with specific properties, likely for a puzzle or environmental effect.",
  "061C": "Best guess: Manages a ferry mechanic, toggling between two destinations (likely ports) using flag 407 to determine the route, updating the ferry’s state with predefined coordinates.",
  "061D": "Best guess: Manages an item interaction, likely a lever or switch, updating its state and triggering a specific game event or object (ID 617) with predefined properties.",
  "061E": "Best guess: Manages a lever or switch interaction, setting specific game state values (likely for a puzzle or mechanism) and triggering an event with object ID 275.",
  "061F": "Best guess: Clears an item flag (ID 15), likely related to a dancing mechanic or animation, with minimal logic.",
  "0620": "Best guess: Sets an item flag (15), possibly for a dance animation or state change.",
  "0621": "Best guess: Handles party member banter for various locations (e.g., dungeons, shrines) and events, with checks for missing quest items (sphere, cube, tetrahedron).",
  "0622": "Best guess: Handles bed interaction, allowing the Avatar to sleep for a chosen number of hours, advancing game time and updating party states.",
  "0623": "Best guess: Wakes the Avatar from a bedroll, addressing them by name and updating party member states.",
  "0624": "Best guess: Retrieves a bedroll, adjusting game state and inventory, with conditional item placement based on eventid.",
  "0625": "Best guess: Handles a confrontation with a Trinsic guard, offering options to bribe, surrender, or fight, with outcomes affecting game state.",
  "0626": "Best guess: Manipulates nearby objects of type 518, moving them based on distance checks, possibly for dynamic interactions.",
  "0627": "Best guess: Interacts with container items (type 377), randomly selecting and using items based on position checks.",
  "0628": "Best guess: Handles beer barrel interaction, updating item frames and displaying complaints about wasting beer.",
  "0629": "Best guess: Handles beer barrel interaction, updating item frames and displaying complaints about wasting beer, with different frame ranges.",
  "062C": "Best guess: Manages a forge routine, combining rock (ID 331) and blood (ID 912) items to craft golem bodies or other items, updating states and flags based on item quality (243 or 244).",
  "062D": "Best guess: Manages a spinning wheel mechanic, converting wool (ID 651) into thread, with dialogue prompting correct item use and updating item states.",
  "062E": "Best guess: Manages a loom mechanic, weaving thread (ID 261) into cloth, with dialogue prompting correct item use and updating item states.",
  "0631": "Best guess: Manages a password-protected door (password: Blackbird), checking NPC status and updating door state.",
  "0632": "Best guess: Spawns items and applies sprite effects at a specific location, possibly for environmental or visual interactions.",
  "0633": "Best guess: Handles NPC reactions to theft, triggering escape behavior and setting flags for NPCs (1, 3, 4).",
  "0634": "Best guess: Manages barge or ferry movement, checking ownership and NPC presence (e.g., ferryman).",
  "0635": "Best guess: Manages oven interaction for baking bread, displaying random dialogue about cooking status.",
  "0636": "Best guess: Applies sprite effects and fades the palette, likely for visual transitions or effects.",
  "0637": "Best guess: Sets the ferry state, possibly for scheduling or activation.",
  "0638": "Best guess: Displays contents of various books (e.g., Dragon Compendium, Alagner’s Book), with special handling for specific book qualities.",
  "0639": "Best guess: Implements the teleportation spell (Kal Ort Por), applying sprite effects and moving the caster to a target location.",
  "063A": "Best guess: Manages random party member or Guardian dialogue during interaction, with phrases questioning the player’s actions, triggered by a single party member.",
  "063C": "Best guess: Spawns a sheep (ID 376) and potentially creates a new item (ID 270) if no sheep is found, updating the game state with specific properties.",
  "063D": "Best guess: Manages a pig’s dialogue, repeating random phrases up to 10 times when interacted with, and saying “Oink” when examined.",
  "063E": "Best guess: Triggers a game-ending event for cheating, displaying accusatory dialogue, applying penalties to the player’s stats, and initiating combat or death.",
  "063F": "Best guess: Triggers a cutscene or event, setting flag 806, centering the view on the Avatar, fading the palette, and manipulating items in a container (ID -356).",
  "0640": "Best guess: Implements the sleep spell (An Zu), targeting a party member and applying a sleep effect with animation.",
  "0641": "Best guess: Implements the wind change spell (Rel Hur), randomly altering wind direction based on spell conditions.",
  "0642": "Best guess: Implements the dispel fire spell (An Flam), extinguishing fires of specific item types with spell effects.",
  "0643": "Best guess: Implements the magic light spell (Bet Ort), creating a light source with sprite effects at the caster’s location.",
  "0644": "Best guess: Implements the weather control spell (Bet Lor), toggling weather states (e.g., rain) with visual effects.",
  "0645": "Best guess: Implements the summon spell (Kal Lor), spawning creatures and setting party flags for combat.",
  "0646": "Best guess: Implements the fireball spell (In Flam), targeting and damaging specific item types with spell effects.",
  "0647": "Best guess: Implements the summon spell (Vas Kal), spawning a creature with visual effects.",
  "0648": "Best guess: Implements the create food spell (In Mani Ylem), generating food items for party members.",
  "0649": "Best guess: Implements the cure poison spell (An Nox), removing poison status from a selected target.",
  "064A": "Best guess: Manages a trap activation mechanic with the spell “Wis Jux,” creating trap items (ID 176) at calculated positions and updating their states.",
  "064B": "Best guess: Manages the \"Vas An Flam\" spell, creating fire-related items (e.g., fire pits, IDs 435, 338, 526, 701) at calculated positions, with a fallback effect if the spell fails.",
  "064C": "Best guess: Manages the \"Vas In Flam\" spell (stronger variant), creating fire-related items (e.g., explosions, IDs 481, 336, 889, 595) at calculated positions, with a fallback effect if the spell fails.",
  "064D": "Best guess: Manages the \"In Lor\" spell, creating a light source (ID 500) with specific properties, with a fallback effect if the spell fails.",
  "064E": "Best guess: Manages the \"In Wis\" spell, displaying the player’s coordinates with directional labels (North, South, East, West), with a fallback effect if the spell fails.",
  "064F": "Best guess: Manages the \"Vas An Zu\" spell, awakening sleeping targets (ID -1) within a radius, with a fallback effect if the spell fails.",
  "0650": "Best guess: Implements the unlock spell (An Jux), unlocking containers (e.g., chests) with visual effects.",
  "0651": "Best guess: Implements the telekinesis spell (Ort Ylem), manipulating specific item types (e.g., levers, switches).",
  "0652": "Best guess: Implements the fire field spell (Vas Flam), creating a damaging fire field at a target location.",
  "0653": "Best guess: Implements the great light spell (Vas Lor), illuminating a large area with weather-like effects.",
  "0654": "Best guess: Implements the mass cure poison spell (Vas An Nox), curing poison for all party members with visual effects.",
  "0655": "Best guess: Implements the protection spell (Uus Sanct), applying a protective effect to a target with visual effects.",
  "0656": "Best guess: Implements the teleport spell (Ort Por Ylem), moving a target to the caster’s location with spell effects.",
  "0657": "Best guess: Implements the douse spell (Por Ort Wis), extinguishing light sources or effects with teleportation effects.",
  "0658": "Best guess: Implements the untrap spell (Des Sanct), disarming traps on a selected target with spell effects.",
  "0659": "Best guess: Implements the heal spell (Mani), restoring NPC health based on property checks.",
  "065A": "Best guess: Manages the \"Kal Bet Xen\" spell, summoning a creature (ID 517) with a random chance, creating it with specific properties if the spell succeeds, or applying a fallback effect.",
  "065B": "Best guess: Manages the \"Vas Uus Sanct\" spell, applying a protective effect (ID 109) to party members, with a fallback effect if the spell fails.",
  "065C": "Best guess: Manages the \"An Por\" spell, teleporting a target (ID 408) to a new location, with a fallback effect if the spell fails.",
  "065D": "Best guess: Manages the \"Vas Wis\" spell, enhancing visibility or perception (ID 408), with a fallback effect if the spell fails.",
  "065E": "Best guess: Manages the \"In Nox\" spell, curing poison (ID 424) on a selected target, with a fallback effect if the spell fails.",
  "065F": "Best guess: Manages the \"In Zu\" spell, putting a selected target (ID 72) to sleep, with a fallback effect if the spell fails.",
  "0660": "Best guess: Implements the summon creature spell (Kal Xen), spawning a random creature from a predefined list.",
  "0661": "Best guess: Implements the lightning spell (Ort Grav), dealing damage to a target area with spell effects.",
  "0662": "Best guess: Implements the summon item spell (Kal Por Ylem), summoning a specific item (type 330) with restrictions.",
  "0663": "Best guess: Implements the mass untrap spell (Vas Des Sanct), disarming traps for nearby party members with visual effects.",
  "0664": "Best guess: Implements the recall spell (Kal Ort Por), teleporting a target (type 330) to the caster’s location with protective effects.",
  "0665": "Best guess: Implements the reveal spell (Wis Quas), revealing hidden objects or NPCs in a grid pattern around the caster.",
  "0666": "Best guess: Implements the stop time spell (Kal Wis Corp), freezing time for a duration based on game time with multiple flags.",
  "0667": "Best guess: Implements the lock spell (Ex Por), locking specific item types (e.g., doors, chests) with frame adjustments.",
  "0668": "Best guess: Implements the freedom spell (An Xen Ex), granting freedom or removing effects from a target with spell effects.",
  "0669": "Best guess: Implements the dance spell (Por Xen), causing nearby NPCs to dance with random exclamations.",
  "066A": "Best guess: Manages the \"An Grav\" spell, dispelling electrical or trap effects (IDs 902, 900, 895, 768) on a selected target, with a fallback effect if the spell fails.",
  "066B": "Best guess: Implements a spell effect (likely a fireball) triggered by eventid 1 or 4, selecting a target, casting with a direction, and creating projectiles or container items.",
  "066C": "Best guess: Manages the \"Vas Mani\" spell, healing a selected target’s health (ID 64) by restoring their hit points, with a fallback effect if the spell fails.",
  "066D": "Best guess: Manages the \"Sanct Lor\" spell, granting invisibility (ID 1645) to a selected target, with a fallback effect if the spell fails.",
  "066E": "Best guess: Manages the \"In Flam Grav\" spell, creating a fire wall or explosion (ID 895) at a selected location, with a fallback effect if the spell fails.",
  "066F": "Best guess: Manages the \"Vas Zu\" spell, putting multiple targets (ID -1) within a radius to sleep, with a fallback effect if the spell fails.",
  "0670": "Best guess: Implements the detect spell (Quas Wis), revealing NPC properties or states for party members.",
  "0671": "Best guess: Implements the clone spell (In Quas Xen), duplicating a valid item with specific status checks.",
  "0672": "Best guess: Implements the fireball storm spell (Kal Flam Grav), spawning multiple fireballs in a grid pattern.",
  "0673": "Best guess: Implements the poison storm spell (Vas In Flam Grav), creating a poison field with random damage.",
  "0674": "Best guess: Implements the wind storm spell (Vas Oort Hur), altering NPC positions with teleportation effects.",
  "0675": "Best guess: Implements the poison field spell (In Nox Grav), creating a poison field at a target location.",
  "0676": "Best guess: Implements the sleep field spell (In Zu Grav), inducing sleep in a target area.",
  "0677": "Best guess: Implements the tremor spell (Vas Por Ylem), causing area-wide effects with random outcomes.",
  "0678": "Best guess: Implements the shape-shift spell (Rel Ylem), transforming an item (type 915) with visual effects.",
  "0679": "Best guess: Implements the death bolt spell (Corp Por), dealing high damage to a target, with special handling for the Avatar (356).",
  "067A": "Best guess: Manages the \"Tym Vas Flam\" spell, igniting a target (ID 621) with a fiery effect, applying status effects and creating visual items, with a fallback effect if the spell fails.",
  "067B": "Best guess: Manages the \"In Sanct Grav\" spell, creating a protective wall or barrier (ID 768) at a selected location, with a fallback effect if the spell fails.",
  "067C": "Best guess: Manages the \"In Hur Grav Ylem\" spell, creating a magical effect or item (ID 399) at a selected location, with a fallback effect if the spell fails.",
  "067D": "Best guess: Manages the \"Vas An Xen Ex\" spell, freeing a creature or entity (ID 1661) within a radius, with random placement and a fallback effect if the spell fails.",
  "067E": "Best guess: Manages the \"In Vas Por\" spell, causing a mass teleport or movement effect (ID 1662) for party members within a radius, with a fallback effect if the spell fails.",
  "067F": "Best guess: Manages the \"Vas Mani\" spell (party variant), healing all party members’ health by restoring hit points, with a fallback effect if the spell fails.",
  "0680": "Best guess: Implements the Armageddon spell (Vas Kal An Mani), triggering catastrophic game state changes with a follow-up incantation.",
  "0681": "Best guess: Implements the death vortex spell (Vas Corp Hur), creating a damaging vortex at a target location.",
  "0682": "Best guess: Implements the mass death spell (Vas Corp), killing nearby NPCs except party members and specific exclusions (e.g., Lord British, Batlin).",
  "0683": "Best guess: Implements the mass protection spell (Vas Sact Lor), applying protection to party members based on distance.",
  "0684": "Best guess: Implements the resurrection spell (In Mani Corp), reviving a dead NPC with specific type and quality checks.",
  "0685": "Best guess: Implements the mass summon spell (Kal Vas Xen), spawning multiple random creatures with weighted probabilities.",
  "0686": "Best guess: Implements the trap spell (In Jux Por Ylem), creating a trap at a target location.",
  "0687": "Best guess: Implements the time acceleration spell (An Tym), speeding up game time.",
  "0688": "Best guess: Updates NPC state, likely a helper function for other scripts (e.g., func_0669, func_0677), setting NPC states and quest flags.",
  "0689": "Best guess: Damages an NPC based on property checks, likely a combat helper function.",
  "068A": "Best guess: Disables a game flag (ID 749) and triggers a game mode switch, likely for a specific event or state reset.",
  "068B": "Best guess: Applies a game effect or status (ID 991) to an entity (ID -356), triggering external functions (0837H, 0838H) if successful, likely for a specific event or interaction.",
  "068C": "Best guess: Applies a game effect or status (ID 739) to an entity (ID -356), triggering external functions (0837H, 0838H) if successful, likely for a specific event or interaction.",
  "068D": "Best guess: Manages a brewing or mixing mechanic, checking item frame (3 or 7) and container items (ID 668), creating a new item (ID 1678) if water is present, or displaying an error message otherwise.",
  "068E": "Best guess: Applies a game effect or status (ID 741) to an entity (ID -356), triggering an external function (0837H) and creating items (IDs 1679, 46) if successful, likely for a specific event or interaction.",
  "068F": "Best guess: Selects a game state or item frame (13, 14, or 15) based on flags 814 and 813, applying it to an item (ID 7750), likely for a puzzle or mechanism.",
  "0690": "Best guess: Handles item type checks (e.g., 707, 760) and triggers func_0691 for blacksmithing interactions.",
  "0691": "Best guess: Manages sword forging with random quality checks and dialogue feedback for the player.",
  "0692": "Best guess: Triggers explosions based on item state, possibly for traps or environmental hazards.",
  "0693": "Best guess: Applies sprite effects and moves items, likely for visual or environmental effects.",
  "0694": "Best guess: Adjusts item frames based on current frame, possibly for animation or state transitions.",
  "0695": "Best guess: Places multiple items at the Avatar’s position, likely for inventory or crafting purposes.",
  "0696": "Best guess: Handles Erethian's transformation dialogue and shape-shifting (gargoyle, dragon, rodent, cow) with incantations.",
  "0697": "Best guess: Manages Erethian's failed transformations (rodent, cow) with sound effects and visual effects.",
  "0698": "Best guess: Spawns items and applies sprite effects, likely for transformation visuals tied to Erethian's shape-shifting.",
  "0699": "Best guess: Aligns party members in a pattern around the Avatar, likely for a ritual or formation setup.",
  "069A": "Best guess: Manages a complex mechanic, likely a teleport or summoning effect (ID 1691), applying effects to entities within a radius, creating multiple items, and updating states with directional calculations.",
  "069B": "Best guess: Triggers an external function call (0699H) after setting up a game state, likely for a specific event or cleanup.",
  "069C": "Best guess: Manages a game mechanic, likely a gender-based event trigger, applying effects within a radius and creating items (ID 1694) based on player gender.",
  "069D": "Best guess: Manages an interaction mechanic with item ID 718, applying directional effects based on item quality (0-7) and triggering an external function (0828H).",
  "069E": "Best guess: Manages a magical ritual by Erethian, involving dialogue, ether surge effects, container item additions, and explosions, likely for a significant spell or quest event.",
  "069F": "Best guess: Manages a puzzle or trap mechanic, iterating over items (ID 275) within a radius, applying effects based on quality (0-6) and creating items (ID 1696).",
  "06A0": "Best guess: Manages Erethian’s spell-casting sequence in a dungeon, creating a well and tools, relocating items to a chest, and adjusting the environment based on flags.",
  "06A1": "Best guess: Modifies items in a dungeon forge, adjusting frames and positions for items with specific quality and frame values, then spawns additional items.",
  "06A2": "Best guess: Attempts to modify items in a dungeon forge but fails, displaying an error message and reverting to a previous state by calling func_06A0.",
  "06A3": "Best guess: Manages a dungeon forge egg, spawning mages, dragons, or golems based on item quality and container contents, with specific flag checks.",
  "06A4": "Best guess: Sets flag 60 when triggered by event ID 3, likely part of a dungeon forge sequence.",
  "06A5": "Best guess: Triggers a hostile reaction against a Fellowship member, displaying a message and initiating combat if flag 6 is set.",
  "06A6": "Best guess: Sets flag 0 and triggers an action with value 1000 when event ID 3 is received and flag 0 is not set, likely part of a dungeon trigger.",
  "06A7": "Best guess: Sets flag 1 and triggers an action with value 1000 when event ID 3 is received and flag 1 is not set, likely part of a dungeon trigger.",
  "06A8": "Best guess: Sets flag 2 and triggers an action with value 1000 when event ID 3 is received and flag 2 is not set, likely part of a dungeon trigger.",
  "06A9": "Best guess: Sets flag 9 when triggered by event ID 3, likely part of a dungeon forge sequence.",
  "06AA": "Best guess: Manages the Avatar’s initial appearance via a moongate, creating and positioning it relative to the Avatar’s location.",
  "06AB": "Best guess: Sets flag 290 and applies an effect to specific NPCs (IDs 90, 92, 86, 87) when triggered by event ID 3, likely part of a dungeon sequence.",
  "06AC": "Best guess: Applies effects to nearby items (within 5 units, type 753) and sets flag 599 when triggered by event ID 3, likely part of a dungeon trap or forge.",
  "06AD": "Best guess: Triggers an external function (ID 704) for the item when event ID 3 is received, likely part of a dungeon interaction.",
  "06AE": "Best guess: Applies an effect to NPC ID 149 via an external function (ID 1173) when event ID 3 is triggered, likely part of a dungeon trap.",
  "06AF": "Best guess: Applies a sleep effect to party members in a poppy field when event ID 3 is triggered, if their strength is not zero.",
  "06B0": "Best guess: Applies a poison effect to party members when event ID 3 is triggered, if their strength is not zero, likely in a toxic area.",
  "06B1": "Best guess: Applies a paralyze effect to party members in a poppy field when event ID 3 is triggered, if their strength is not zero.",
  "06B2": "Best guess: Triggers external functions (IDs 336, 595, 889) for party members when event ID 3 is received, likely part of a dungeon environmental effect.",
  "06B3": "Best guess: Triggers external functions (IDs 338, 701, 526) for party members when event ID 3 is received, likely part of a dungeon environmental effect.",
  "06B4": "Best guess: Randomly applies an effect to a party member when event ID 3 is triggered, based on item quality and a random selection.",
  "06B5": "Best guess: Manages an egg in a blacksmith’s house, checking nearby items (types 270, 376) and triggering external functions based on their properties.",
  "06B6": "Best guess: Triggers effects on nearby items (type 873, within 20 units) based on their frame, cycling through specific sequences in a dungeon trap.",
  "06B7": "Best guess: Randomly selects a party member and triggers an external function (ID 1551) when event ID 3 is received, likely part of a dungeon trap.",
  "06B8": "Best guess: Applies effects to party members with non-zero strength when event ID 3 is triggered, potentially paralyzing them and triggering a sequence.",
  "06B9": "Best guess: Displays a distress message (“Help! Help!”) via an item when event ID 3 is triggered, likely in a dungeon or trap scenario.",
  "06BA": "Best guess: Applies effects to party members with non-zero strength, displaying random distress messages and triggering a sequence when event ID 3 is received.",
  "06BB": "Best guess: Applies effects to party members not matching a specific NPC ID (356) with non-zero dexterity, triggering a sequence when event ID 3 is received.",
  "06BC": "Best guess: Applies effects to nearby items (type 359, within 40 units) not already affected when event ID 3 is triggered, likely part of a dungeon trap.",
  "06BD": "Best guess: Triggers a complex sequence of effects on nearby items and party members when event ID 3 is received, with random selections and array-based operations.",
  "06BE": "Best guess: Triggers an effect based on the item’s quality when event ID 3 is received, likely part of a dungeon interaction.",
  "06BF": "Best guess: Randomly applies an effect to party members based on item quality when event ID 3 is triggered, likely part of a dungeon trap.",
  "06C0": "Best guess: Applies an effect to nearby items (type 494, within 99 units) based on their state when event ID 3 is triggered, likely in a dungeon.",
  "06C1": "Best guess: Manages a complex dungeon sequence, checking flags and applying effects to items (types 867, 338, 810, 912) and NPCs (167, 177) based on timers and conditions.",
  "06C2": "Best guess: Manages a dungeon sequence, checking flag 87 and applying effects to items (type 912) and NPCs (414) based on their frames and timers.",
  "06C3": "Best guess: Manages the Minoc murder scene, setting flag 290, managing timers, and triggering effects when event ID 3 is received.",
  "06C4": "Best guess: Sets flag 695 when event ID 3 is triggered, likely part of a dungeon or event trigger.",
  "06C5": "Best guess: Sets flag 151 when event ID 3 is triggered, likely part of a dungeon or event trigger.",
  "06C6": "Best guess: Checks multiple flags (544, 555, 548, 554, 549) and triggers effects on NPCs (167, 177) based on flag conditions when event ID 3 is received.",
  "06C7": "Best guess: Applies an effect to specific NPCs (90, 82, 81, 91, 93) when event ID 3 is triggered, likely part of a dungeon sequence.",
  "06C8": "Best guess: Applies an effect to specific NPCs (85, 8, 88) when event ID 3 is triggered, likely part of a dungeon sequence.",
  "06C9": "Best guess: Triggers an effect on NPCs (94, 95) when approaching the Minoc mill, activated by event ID 3.",
  "06CA": "Best guess: Triggers an effect on NPCs (92, 86, 87) when event ID 3 is activated, likely part of a dungeon or Minoc-related sequence.",
  "06CB": "Best guess: Initializes a variable to 0 when event ID 3 is triggered, likely a placeholder or minimal dungeon trigger.",
  "06CC": "Best guess: Applies effects to party members when event ID 3 is triggered and flag 5 is not set, based on item quality, likely in a dungeon trap.",
  "06CF": "Best guess: Checks flag 4 and creates an item (type 535, quality 1161) at a specific location when event ID is not specified, likely part of a dungeon setup.",
  "06D0": "Best guess: Triggers an external function (ID 2064) with parameters (0, 0) when event ID 3 is received, likely part of a puzzle or dungeon trigger.",
  "06D1": "Best guess: Triggers an external function (ID 2064) with parameters (1, 0) when event ID 3 is received, likely part of a puzzle or dungeon trigger.",
  "06D2": "Best guess: Triggers an external function (ID 2064) with parameters (0, 1) when event ID 3 is received, part of a puzzle sequence.",
  "06D3": "Best guess: Triggers an external function (ID 2064) with parameters (1, 1) when event ID 3 is received, part of a puzzle sequence.",
  "06D4": "Best guess: Checks flag 4 and creates an item (type 600, quality 1288) at a specific location when event ID 3 is triggered, likely part of a dungeon puzzle.",
  "06D5": "Best guess: Checks flag 5 and creates an item (type 1855, quality 2846) at a specific location when event ID 3 is triggered, likely part of a dungeon puzzle.",
  "06D6": "Best guess: Manages a dungeon trap, checking nearby items (type 981) and applying effects to items (type 275, quality 50) when event ID 3 is triggered.",
  "06D7": "Best guess: Checks flag 468 and triggers an effect with parameter 5 when event ID 3 is received, likely part of a dungeon sequence.",
  "06D8": "Best guess: Checks flag 343 and triggers an effect with parameter 3 when event ID 3 is received, likely part of a dungeon sequence.",
  "06D9": "Best guess: Checks flag 142 and triggers an effect with parameter 4 when event ID 3 is received, likely part of a dungeon sequence.",
  "06DA": "Best guess: Triggers an effect with parameter 359 when event ID 3 is received, likely part of a dungeon or trap sequence.",
  "06DB": "Best guess: Triggers an external function (ID 2084) when event ID 3 is received, likely part of a dungeon or trap sequence.",
  "06DC": "Best guess: Disables a flag or effect when event ID 3 is triggered, likely part of a dungeon or trap deactivation.",
  "06DD": "Best guess: Triggers an effect with parameter 1 when event ID 3 is received, likely part of a dungeon or trap sequence.",
  "06DE": "Best guess: Triggers an effect with parameter 0 when event ID 3 is received, likely part of a dungeon or trap sequence.",
  "06DF": "Best guess: Checks flag 3 and creates an item (type 845, quality 2663) if specific conditions are met when event ID 3 is triggered, likely part of a dungeon puzzle.",
  "06E0": "Best guess: Checks flag 4 and triggers effects on nearby items (types 776, 777) when event ID 3 is received, likely part of a dungeon trap.",
  "06E1": "Best guess: Counts active flags (3, 4, 5, 301, 308, 322, 353, 493, 609) and triggers an effect based on the count when event ID 3 is received, likely a dungeon or quest trigger.",
  "06E2": "Best guess: Triggers an effect with parameter 128 when event ID 3 is received, likely a minimal dungeon trigger.",
  "06F5": "Best guess: Manages Erethian's dialogue and sword creation sequence, handling item placement and flag updates when event ID is triggered.",
  "06F6": "Best guess: Manages dialogue with Arcadion in the mirror or sword, handling multiple conversation paths and flag updates based on player choices.",
  "06F7": "Best guess: Tracks scrolls in a forge, checking containers for specific items (types 240–248) and updating flags when conditions are met, likely part of a quest.",
  "06F8": "Best guess: Manages the entry to the forge, handling Erethian's dialogue, mirror interactions, and flag-based sequences when event ID 2 or 3 is triggered.",
  "06F9": "Best guess: Manages an egg outside the forge, triggering different item creations based on event IDs and item types, with flag checks and dialogue.",
  "06FA": "Best guess: Displays dialogue based on item types (275, 721, 989) when triggered, likely indicating environmental events like tremors or instability.",
  "06FB": "Best guess: Handles item interactions based on event IDs 2 or 3, triggering external calls and flag-based actions, likely related to a forge or quest trigger.",
  "06FC": "Best guess: Manages item selection and positioning for event ID 2, adjusting coordinates and triggering effects, likely part of a forge or combat mechanic.",
  "06FD": "Best guess: Manages item interactions for event ID 2, adjusting positions and triggering effects for items with specific quality and frame, likely part of a forge or environmental mechanic.",
  "0708": "Best guess: Silently destroys an item, possibly a cleanup function for ritual or event completion.",
  "0709": "Best guess: Sets a flag to true, likely a trigger or state initializer for an event or ritual.",
  "070A": "Best guess: Manages a summoning ritual (ID 1802), triggered by event 3, summoning an entity (ID 641) and applying environmental effects, with cleanup for various item types.",
  "070B": "Best guess: Manages a container mechanic, checking items within a container (ID -356), applying effects based on container state, and creating items (ID 1803).",
  "070C": "Best guess: Manages a game mechanic checking for items (IDs 604, 729) and transforming a container (ID 641) with specific effects and sound.",
  "070D": "Best guess: Manages a helmet egg mechanic in the Courage region, checking for helms (IDs 383, 541) and altering portcullis (ID 936) or metal wall (ID 303) states based on quality.",
  "070E": "Best guess: Manages a door mechanic in the Courage region, checking flags (829, 830) to toggle door (ID 936) and metal wall (ID 303) states based on quality.",
  "070F": "Best guess: Manages a mechanic for item type 466, creating a body (ID 414) and items (IDs 797, 1783) with environmental effects, or handling container items (ID 797) with quality checks.",
  "0710": "Best guess: Manages the golem ritual, checking blood-covered rocks and displaying scroll instructions.",
  "0712": "Best guess: Destroys items in a container, possibly for ritual cleanup or object removal.",
  "0713": "Best guess: Applies visual effects and destroys items, likely for a ritual or trap effect.",
  "0714": "Best guess: Performs a heart placement ritual with Bollux's sacrifice and incantations for golem creation.",
  "0715": "Best guess: Checks for ritual items and triggers the endgame sequence if conditions are met.",
  "0716": "Best guess: Initializes ritual state and checks for items, similar to func_0715 but with flag reset.",
  "0717": "Best guess: Checks item type (668) and triggers explosions, possibly for a trap or ritual effect.",
  "0800": "Best guess: Handles bed interaction, triggering rest or dialogue if in combat or not a bedroll.",
  "0801": "Best guess: Tests if an item is a bedroll (type 1011, frame 17).",
  "0802": "Best guess: Builds an array of items excluding a specified value, likely for filtering purposes.",
  "0803": "Best guess: Spawns an item (type 981) with specific positioning, possibly for an event trigger.",
  "0804": "Best guess: Finds an item matching frame and quality criteria, destroying it if found.",
  "0805": "Best guess: Spawns and destroys items (type 981, 776) with positioning, likely for an event or effect.",
  "0806": "Best guess: Places items (type 968) around a position, setting a spell duration, likely for an area effect.",
  "0807": "Best guess: Spawns an item (type 981) with positioning, likely for an event trigger.",
  "0808": "Best guess: Removes party members and resets flags, possibly for party management or event cleanup.",
  "0809": "Best guess: Manages cart interaction, checking ownership and triggering movement or dialogue.",
  "080A": "Best guess: Manages a seating arrangement mechanic, finding nearby seats (P0) and assigning party members to the closest available seat (P1), excluding the clicked seat.",
  "080B": "Best guess: Manages a state counter, adjusting its value based on comparisons and flag 743, returning the final state.",
  "080C": "Best guess: Identifies the type of an item (ID -359) within a radius, returning a specific item ID (840, 652, or 199) based on predefined lists.",
  "080D": "Best guess: Checks if all party members are seated (frame 10 or 26), returning true if all are seated, false otherwise.",
  "080E": "Best guess: Checks for bridge-blocking items (ID 870) within a radius, displaying a message if blocked, and creates items (ID 1553) with specific properties.",
  "080F": "Best guess: Clears specific items (IDs 867, 338, 336, 810, 912, 636, 168) within a radius when triggered by event 3.",
  "0810": "Best guess: Manages a cube puzzle, spawning floors (type 368 or 369) based on egg proximity.",
  "0811": "Best guess: Adds party members to the party with flag settings, likely for event initialization.",
  "0812": "Best guess: Plays music and adds items if music is not playing, possibly for ambiance or event trigger.",
  "0813": "Best guess: Handles NPC feeding (e.g., garlic, type 842), adjusting NPC properties with dialogue responses.",
  "0814": "Best guess: Checks for items (type 414) within a specific area, likely for puzzle or ritual validation.",
  "0815": "Best guess: Manages door state (locked/unlocked) with dialogue feedback, tied to quality checks.",
  "0816": "Best guess: Handles door locking/unlocking based on quality and flag states, with item spawning.",
  "0817": "Best guess: Updates door states based on flag conditions, spawning items for visual effects.",
  "0818": "Best guess: Displays a blocked door message, likely for interaction feedback.",
  "0819": "Best guess: Displays a locked door message, likely for interaction feedback.",
  "081A": "Best guess: Displays a message indicating an item is magically locked when interacted with.",
  "081B": "Best guess: Returns the modulo 4 of an item’s frame, likely for state cycling.",
  "081C": "Best guess: Adjusts an item’s frame (P1) by adding a value (P0) and ensuring the result is modulo 4, updating the item’s frame.",
  "081D": "Best guess: Updates an item’s type (P4) and frame (P3), moving it to a new position (P1, P2), returning true if successful.",
  "081E": "Best guess: Checks if an item (P7) matches a specific frame (P6) and position (P5) near a pedestal (P8), triggering an action (081DH) if conditions are met.",
  "081F": "Best guess: Manages a mechanic checking an item’s frame state (via 081BH), triggering actions (081DH, 0818H) based on frame values (0 or 1), and setting flags or states.",
  "0820": "Best guess: Locks a door (type 828) if not blocked, setting behavior flags.",
  "0821": "Best guess: Adds items to a container, likely for inventory or event effects.",
  "0822": "Best guess: Reorders array elements, possibly for position or state updates.",
  "0823": "Best guess: Updates item position based on quality and predefined arrays, tied to environmental effects.",
  "0824": "Best guess: Applies damage to the party or sets game state based on item type and quality, likely for traps or hazards.",
  "0825": "Best guess: Adjusts array indices based on comparison, possibly for position alignment.",
  "0826": "Best guess: Checks if an item type is in a specific set (157, 779), likely for validation.",
  "0827": "Best guess: Sets an array value at a specific index, likely for state management.",
  "0828": "Best guess: Moves items (e.g., bucket contents) to a new location, handling arrays and positioning.",
  "0829": "Best guess: Manages gangplank positioning (type 781 or 150), adjusting based on frame and location.",
  "082A": "Best guess: Increments an array index and accumulates values from P2, adding P1 values, returning the modified array P2.",
  "082B": "Best guess: Negates values in an array (P1) at specified indices, returning the modified array.",
  "082C": "Best guess: Checks if a gangplank (P3) is blocked by items (P0) within a radius defined by P1, returning true if blocked, false otherwise.",
  "082D": "Best guess: Manages gangplank positioning for item types 781 or 150, adjusting position arrays using helper functions (082BH, 082AH).",
  "082E": "Best guess: Manages the placement of prisms by the Black Gate, checking for beams (ID 168) and pedestals (ID 577), aligning prisms (ID 981) and updating frames.",
  "082F": "Best guess: Manages a rat race game, checking game objects (IDs 763, 764) and assigning random states to items (ID 644) based on time and position.",
  "0830": "Best guess: Adjusts sail states (type 199) on a mast, likely for ship navigation.",
  "0831": "Best guess: Manages ship gangplank and sail status to enable sailing, displaying a message if the gangplank is blocked and configuring item ownership.",
  "0832": "Best guess: Adds items to a container, likely for inventory or event effects.",
  "0833": "Best guess: Adds items to a container with different parameters, likely for inventory or event effects.",
  "0834": "Best guess: Raises portcullises (types 271, 272) and adds items, tied to flag-based state changes.",
  "0835": "Best guess: Adjusts an NPC property by subtracting a value, likely for stat management.",
  "0836": "Best guess: Updates item types (e.g., 303, 876, 935, 936) based on quality, likely for puzzle or state transitions.",
  "0837": "Best guess: Moves an item to a new location with offset, checking position and container validity.",
  "0838": "Best guess: Adds items to a container based on item frame (8–12), likely for visual or event effects.",
  "0839": "Best guess: Sets item type and state based on event ID, destroying items for specific events.",
  "083A": "Best guess: Retrieves the location of a Triples game (ID 814) near the Avatar and appends it to an array, returning the array.",
  "083B": "Best guess: Analyzes Triples game items (ID 809), counting frame-based states (1, 2, 3) and checking for winning conditions (all same state).",
  "083C": "Best guess: Collects money items (ID 644) near a Triples game (ID 809) within a specified radius, filtering by position proximity.",
  "083D": "Best guess: Manages a Triples game, evaluating game state (via 083BH), determining outcomes, and distributing rewards based on money items (via 083CH).",
  "083E": "Best guess: Manages a winch mechanic, handling events to raise/lower objects (via 0828H) and checking for blockers (via 080EH), with quality-based filtering.",
  "083F": "Best guess: Checks for items (IDs 271, 272) matching the quality of a winch (P1), applying effects (via 0834H) and updating states if conditions are met.",
  "0840": "Best guess: Manages a sage conversation, offering a notebook key if dialogue choices are correct.",
  "0841": "Best guess: Handles a purchase interaction for food/drink items (e.g., ale, wine, ham), with price and quantity prompts.",
  "0843": "Best guess: Hides an NPC (290) and adds items to a container, likely for an event or cleanup.",
  "0844": "Best guess: Searches for an item with frame 12, returning it if found, likely for item filtering.",
  "0845": "Best guess: Manages a daemon interaction, restoring magical reserves if conditions are met, with dialogue feedback.",
  "0846": "Best guess: Checks item properties (type 668, 760) for specific values, likely for puzzle or state validation.",
  "0847": "Best guess: Checks if an item type matches a list (e.g., 400, 414), returning true if found, likely for validation.",
  "0848": "Best guess: Checks if an item type matches a list (e.g., 504, 505), returning true if found, likely for validation.",
  "0849": "Best guess: Checks if an item type matches a list (e.g., 519, 354), returning true if found, likely for validation.",
  "084A": "Best guess: Initializes party members with specific items (IDs 411, 403) and positions (IDs 318, 315, 309, 306), placing items in containers.",
  "084B": "Best guess: Prompts for a number input, validates it against a range (50 to eventid/2), and creates money items (ID 644) if valid.",
  "084C": "Best guess: Manages a shop interaction, allowing the purchase of items (e.g., cloth, jar) with quantity and price validation, handling inventory and gold checks.",
  "084D": "Best guess: Manages a dialogue sequence for joining The Fellowship, handling quest failure, membership offer, and examination prompts.",
  "084E": "Best guess: Conducts The Fellowship’s examination, presenting eight hypothetical questions to assess the player’s character, concluding with membership approval.",
  "084F": "Best guess: Manages The Fellowship induction ceremony, including speeches, member testimonials, and a final test, with opportunities for the player to abort.",
  "0850": "Best guess: Depicts a Fellowship ceremony led by Batlin, explaining the Triad of Inner Strength and featuring NPC testimonials and party reactions.",
  "0851": "Best guess: Initiates a quest to deliver a sealed package to Elynor in Minoc, checking inventory and setting quest flags.",
  "0852": "Best guess: Implements a quiz system testing Britannian lore, setting flags for correct answers and rewarding completion.",
  "0853": "Best guess: Handles a shop transaction for eclectic items, with quantity prompts for bulk items like oil flasks.",
  "0854": "Best guess: Manages a meat-selling transaction with a butcher, checking inventory and gold, part of the game’s economy system.",
  "0855": "Best guess: Manages a tavern transaction for food and drink, with quantity prompts for bulk items like jerky.",
  "0856": "Best guess: Manages archery training with Bradman, checking gold and skill levels, and improving hand-eye coordination.",
  "0857": "Best guess: Processes a pumpkin-selling transaction, checking inventory and rewarding gold.",
  "0858": "Best guess: Handles a weapon shop transaction, with bulk purchase options for items like bolts and arrows.",
  "0859": "Best guess: Manages an armor shop transaction, with single-item purchases for items like gauntlets and plate armor.",
  "085A": "Best guess: Manages a shop interaction for lockpicks and torches, with price and quantity validation, handling inventory and gold checks, with flag-based dialogue variations.",
  "085B": "Best guess: Generates random NPC dialogue for an NPC (ID -244) in a specific state (ID 11), expressing frustration or confusion.",
  "085C": "Best guess: Manages a clothing shop interaction, allowing the purchase of apparel (e.g., hood, tunic) with price validation, handling inventory and gold checks.",
  "085D": "Best guess: Manages a food shop interaction, allowing the purchase of items (e.g., ham, trout) with quantity and price validation, handling inventory and gold checks.",
  "085E": "Best guess: Manages a tavern interaction, allowing the purchase of ale or wine with price validation, handling inventory and gold checks.",
  "085F": "Best guess: Manages a training session with Chad, checking player stats and gold, providing combat training if conditions are met.",
  "0860": "Best guess: Offers healing, poison curing, or resurrection services, with cost checks and party member selection.",
  "0861": "Best guess: Displays a warning for breaking \"The Game\" rules, aborting the script.",
  "0862": "Best guess: Manages a dialogue with Chuckles, providing a scroll (item 797) if conditions are met.",
  "0863": "Best guess: Manages NPC health and combat status, updating stats and destroying items if needed.",
  "0864": "Best guess: Randomly selects dialogue for an NPC (ID 253) based on status, likely for ambient flavor.",
  "0865": "Best guess: Generates word pairs (e.g., \"soup\" or \"soups\"), possibly for linguistic puzzles.",
  "0866": "Best guess: Generates noun pairs (e.g., \"batting cage\" or \"batting cages\"), likely for item or concept references.",
  "0867": "Best guess: Generates adjective pairs (e.g., \"constipated\", \"dyslexic\"), possibly for NPC descriptions.",
  "0868": "Best guess: Generates verb conjugations (e.g., \"lactate\", \"lactated\"), likely for dialogue or actions.",
  "0869": "Best guess: Generates verb conjugations (e.g., \"collate\", \"collating\"), possibly for event triggers.",
  "086A": "Best guess: Generates a random humorous phrase from a predefined list, likely for NPC dialogue or a comedic effect.",
  "086B": "Best guess: Generates a random phrase from a predefined list, likely for NPC dialogue or a dramatic effect.",
  "086C": "Best guess: Generates a random singular/plural noun pair from a list of animals and biological categories, appending \"s\" to the singular form if the plural is \"*\".",
  "086D": "Best guess: Generates a random singular/plural noun pair from a list of biological, cultural, and humorous terms, appending \"s\" to the singular form if the plural is \"*\".",
  "086E": "Best guess: Generates a random slang or insult term from a list, likely for dynamic dialogue or NPC interactions.",
  "086F": "Best guess: Generates dynamic dialogue by combining random noun pairs from external functions, creating humorous or dramatic phrases for NPC interactions.",
  "0870": "Best guess: Offers healing, poison curing, or resurrection services, with cost checks and party member selection.",
  "0871": "Best guess: Handles purchase of food/drink items (e.g., wine, jerky), with a flag check for silverleaf availability.",
  "0872": "Best guess: Manages purchase of weapons (e.g., bolts, sword).",
  "0873": "Best guess: Handles purchase of armor (e.g., leather armor, wooden shield).",
  "0874": "Best guess: Manages purchase of adventuring gear (e.g., bedroll, torch).",
  "0875": "Best guess: Provides training in strength, dexterity, and intelligence, with detailed dialogue and stat improvements.",
  "0876": "Best guess: Handles purchase of provisions (e.g., milk, mutton rations).",
  "0877": "Best guess: Narrates the story of Nastassia, setting a flag to track progress.",
  "0878": "Best guess: Offers combat training, focusing on sleight of hand and strike feints.",
  "0879": "Best guess: Offers healing, poison curing, or resurrection services, with cost checks and party member selection.",
  "087A": "Best guess: Manages a merchant transaction, allowing the player to buy items with quantity and weight checks, using dialogue for negotiation.",
  "087B": "Best guess: Depicts a Fellowship ceremony led by Elynor, with members sharing testimonials, advancing the Fellowship narrative.",
  "087C": "Best guess: Handles an interaction with an Emp requesting honey, with dialogue and inventory checks, tying into a quest or environmental interaction.",
  "087D": "Best guess: Adjusts an item’s frame based on player gender and current frame, likely for visual customization.",
  "087E": "Best guess: Searches for nearby items meeting positional and type criteria, processing them with external functions, possibly for inventory or environmental checks.",
  "087F": "Best guess: Searches for nearby items with specific quality and frame attributes, processes them, and triggers explosions, likely for inventory or environmental effects.",
  "0880": "Best guess: Checks and sets item attributes (type, frame) around a position, likely for environmental interactions.",
  "0881": "Best guess: Searches for items with specific frames (18–21), possibly for event triggers.",
  "0882": "Best guess: Manages ferry interactions, checking barge and ferryman, initiating sitting actions.",
  "0883": "Best guess: Introduces a murder investigation, switching dialogue to an NPC (Petre) and prompting a search.",
  "0884": "Best guess: Progresses a murder investigation with a multi-step dialogue (occupation, evidence, suspect).",
  "0885": "Best guess: Handles evidence discussion in the murder investigation, setting flags for progress.",
  "0886": "Best guess: Conducts a geography quiz to verify the player’s identity, requiring map-based answers.",
  "0887": "Best guess: Performs complex item manipulation and explosion creation, possibly for combat or traps.",
  "0888": "Best guess: Processes items with specific types (721, 989), adjusting properties and ownership.",
  "0889": "Best guess: Manages purchase of provisions (e.g., wine, cheese) with a unique dialogue style.",
  "088A": "Best guess: Manages Forsythe’s decision to sacrifice himself, checking party size and leading him to a well, updating flags and dialogue.",
  "088B": "Best guess: Triggers a sacrifice event, creating a well item (ID 748), updating NPC states, and setting a flag for quest progression.",
  "088C": "Best guess: Manages a food shop interaction, allowing the purchase of various meats (e.g., dried meat, trout) with quantity and price validation.",
  "088D": "Best guess: Manages a brief dialogue with Gargan, who coughs and smokes a pipe, responding to a health inquiry.",
  "088E": "Best guess: Manages a clothing shop interaction, allowing the purchase of apparel (e.g., swamp boots, tunic) with price validation.",
  "088F": "Best guess: Manages a tavern interaction, allowing the purchase of ale or wine with price validation, handling inventory and gold checks.",
  "0890": "Best guess: Handles dialogue with Adjhar, progressing a quest involving Bollux’s sacrifice and the book \"The Stone of Castambre\".",
  "0891": "Best guess: Advances the quest by revealing how to restore Bollux using a new heart from the Tree of Life.",
  "0892": "Best guess: Manages post-quest dialogue with Adjhar, offering the Talisman of Love.",
  "0893": "Best guess: Handles final dialogue with Adjhar after mastering the Principle of Love.",
  "0894": "Best guess: Initiates the quest to restore Adjhar, offering a book and discussing golem creation.",
  "0895": "Best guess: Manages dialogue with Bollux after restoration, acknowledging Adjhar’s revival.",
  "0896": "Best guess: Handles dialogue with Bollux after he loses his duty.",
  "0897": "Best guess: Manages purchase of armor (e.g., leather gloves, plate armor).",
  "0898": "Best guess: Manages purchase of weapons (e.g., 2-handed sword, dagger).",
  "0899": "Best guess: Manages purchase of tools (e.g., bucket, shovel).",
  "089A": "Best guess: Manages a gargoyle-led magic training session, checking player intelligence and gold, enhancing mental capabilities if conditions are met.",
  "089B": "Best guess: Manages a gargoyle-led combat training session, checking player strength and gold, enhancing physical prowess if conditions are met.",
  "089C": "Best guess: Manages a weapons shop interaction, allowing the purchase of weapons (e.g., boomerang, throwing axe) with price validation.",
  "089D": "Best guess: Manages a gargoyle healer’s services (heal, cure poison, resurrect), selecting a target and applying effects based on gold and conditions.",
  "089E": "Best guess: Manages a human healer’s services (heal, cure poison, resurrect), selecting a party member and applying effects based on gold or party status.",
  "089F": "Best guess: Manages a combat training session with Jakher, checking player intelligence and gold, enhancing tactical skills if conditions are met.",
  "08A0": "Best guess: Manages a shop dialogue for purchasing food and drink items, handling item selection, pricing, and inventory checks.",
  "08A1": "Best guess: Manages a shop dialogue for purchasing adventuring gear, handling item selection, pricing, and inventory checks with quantity prompts.",
  "08A2": "Best guess: Manages a training session dialogue with Jillian, checking player stats and gold, and applying stat increases upon successful payment.",
  "08A3": "Best guess: Manages a shop dialogue for purchasing ranged weapon ammunition (bolts, arrows), handling pricing and inventory checks.",
  "08A4": "Best guess: Manages a shop dialogue for purchasing ranged weapons (bows, crossbows), handling pricing and inventory checks.",
  "08A5": "Best guess: Displays random poetic dialogue for an item (likely a statue or book) based on a random selection, possibly for ambiance or lore.",
  "08A6": "Best guess: Manages a combat training session with Karenna, checking player stats and gold, and applying stat increases upon successful payment.",
  "08A7": "Best guess: Manages a shop dialogue for purchasing produce (e.g., grapes, eggs), handling item selection, pricing, and inventory checks with quantity prompts for bulk items.",
  "08A8": "Best guess: Manages a shop dialogue for purchasing potions (e.g., healing, invisibility), handling item selection, pricing, and inventory checks with quantity prompts.",
  "08A9": "Best guess: Manages a shop dialogue for purchasing melee weapons (e.g., halberd, dagger), handling item selection, pricing, and inventory checks with quantity prompts for bulk items.",
  "08AA": "Best guess: Manages a shop dialogue for purchasing armor pieces (e.g., gorget, scale armour), handling item selection, pricing, and inventory checks.",
  "08AB": "Best guess: Manages a Fellowship meeting dialogue led by Klog in Trinsic, with multiple NPCs giving testimonials and player reactions, advancing a narrative sequence.",
  "08AC": "Best guess: Manages a healer’s dialogue offering services (heal, cure poison, resurrect), handling service selection, pricing, and application to party members.",
  "08AD": "Best guess: Manages Horance’s dialogue in Skara Brae, guiding the player through a quest to destroy the Well of Souls, with flag-based progression and NPC interactions.",
  "08AE": "Best guess: Handles Horance’s response to the player’s decision regarding the Well of Souls quest, setting flags based on acceptance or refusal.",
  "08AF": "Best guess: Advances Horance’s Well of Souls quest dialogue, checking party members and flags to guide the player toward finding a sacrificial spirit.",
  "08B0": "Best guess: Displays descriptive dialogue about a liche’s state, varying based on a flag, likely part of a Skara Brae encounter.",
  "08B1": "Best guess: Concludes Horance’s Well of Souls quest in Skara Brae, rewarding the player with a magical staff and expressing intent to restore the town.",
  "08B2": "Best guess: Manages Horance’s post-quest dialogue in Skara Brae, prompting the player to continue their main quest and discussing the town’s future.",
  "08B3": "Best guess: Manages party member interactions, updating the party list based on item qualities and conditions, likely for quest or dialogue purposes.",
  "08B4": "Best guess: Manages a free healer’s dialogue offering services (heal, cure poison, resurrect), handling service selection and application to party members.",
  "08B5": "Best guess: Manages Lord British’s dialogue, granting the player a ship (Golden Ankh) and a magical crystal for the Castle of Fire, with inventory checks.",
  "08B6": "Best guess: Manages a training session with Lucky, teaching sleight-of-hand tricks and potentially increasing intelligence, with gold and experience checks.",
  "08B7": "Best guess: Manages a shop dialogue for purchasing food and drink items, similar to func_08A0, with handling for Silverleaf scarcity.",
  "08B8": "Best guess: Manages a dialogue for exchanging eggs for gold, checking the player’s inventory and handling payment or rejection.",
  "08B9": "Best guess: Manages a shop dialogue for purchasing tavern items (e.g., ale, mutton), handling item selection, pricing, and Silverleaf scarcity.",
  "08BA": "Best guess: Manages Margareta’s fortune-telling dialogue, providing quest-related prophecies for 20 gold, with gender-specific dialogue and flag progression.",
  "08BB": "Best guess: Manages a shop dialogue for purchasing spells from different magical circles, handling spell selection, pricing, and spellbook checks.",
  "08BC": "Best guess: Manages a shop dialogue for purchasing reagents or potions, handling item selection, pricing, and inventory checks based on the input parameter.",
  "08BD": "Best guess: Manages a combat training session with Markus, teaching sword techniques and potentially increasing combat ability, with gold and experience checks.",
  "08BE": "Best guess: Manages a strength training session, teaching weight training and combat techniques, potentially increasing strength and combat ability, with gold and experience checks.",
  "08BF": "Best guess: Compares a party member’s strength and mana, adjusting mana if strength exceeds it, likely for balance or quest purposes.",
  "08C0": "Best guess: Manages Mordra’s dialogue in Skara Brae, providing information about NPCs, the Liche, and the Well of Souls, with flag-based progression and topic selection.",
  "08C1": "Best guess: Manages a dialogue between Mordra and Rowena in Skara Brae, discussing Rowena’s rescue and the need to reunite her with Trent.",
  "08C2": "Best guess: Manages a heated dialogue between Mordra and Mayor Forsythe in Skara Brae, discussing his sacrifice for the Well of Souls, with NPC interactions.",
  "08C3": "Best guess: Manages a shop dialogue for purchasing spells from different magical circles, similar to func_08BB, with different spell selections and pricing.",
  "08C4": "Best guess: Manages a shop dialogue for purchasing magical reagents, handling item selection, pricing, and inventory checks with a casual tone.",
  "08C5": "Best guess: Manages a shop dialogue for purchasing spells from different magical circles, handling spell selection, pricing, and spellbook checks, similar to func_08BB and func_08C3.",
  "08C6": "Best guess: Manages a shop dialogue for purchasing magical reagents, handling item selection, pricing, and inventory checks.",
  "08C7": "Best guess: Manages a scripted Fellowship play performance, promoting their philosophy through a theatrical narrative, with NPC interactions and flag setting.",
  "08C8": "Best guess: Manages a strength training session with Penni, teaching physical exercises, potentially increasing strength and combat ability, with gold and experience checks.",
  "08C9": "Best guess: Checks if four blackrock pieces are correctly placed around a pedestal, likely for a puzzle or quest trigger in Penumbra’s area.",
  "08CA": "Best guess: Manages an intelligence and magic training session with Perrin, teaching theoretical concepts, potentially increasing intelligence and mana, with gold and experience checks.",
  "08CB": "Best guess: Manages a shop dialogue for purchasing food items, handling item selection, pricing, and Silverleaf scarcity based on a flag.",
  "08CC": "Best guess: Manages a shop dialogue for purchasing alcoholic beverages (ale, wine), handling item selection, pricing, and inventory checks.",
  "08CD": "Best guess: Manages a shop dialogue for purchasing food and drink items, handling item selection, pricing, and inventory checks with quantity prompts.",
  "08CE": "Best guess: Manages a scripted Fellowship sermon by a winged gargoyle, promoting their philosophy, with NPC interactions and party member reactions.",
  "08CF": "Best guess: Manages a scripted Fellowship sermon focusing on trust, with NPC interactions and an option to leave early prompted by Iolo.",
  "08D0": "Best guess: Manages a training session with Rayburt, teaching meditation and combat techniques, potentially increasing dexterity, intelligence, and combat ability, with gold and experience checks.",
  "08D1": "Best guess: Manages an acting audition with Raymundo, where the player rehearses lines as the Avatar, receiving a staff prop to improve performance.",
  "08D2": "Best guess: Manages a dialogue with a healer offering resurrection, curing, or healing services, with gold checks and party member selection.",
  "08D3": "Best guess: Manages a shop dialogue for purchasing weapons, handling item selection, pricing, and inventory checks, with a comment on taxes.",
  "08D4": "Best guess: Manages a shop dialogue for purchasing armor pieces, handling item selection, pricing, and inventory checks.",
  "08D5": "Best guess: Manages a dialogue with a healer explaining how the player was rescued and brought to their shelter, with location-specific details based on flags.",
  "08D6": "Best guess: Manages a dialogue with Trent and Rowena after their reunion, where they refuse a sacrifice and focus on their love, with an option to end the conversation.",
  "08D7": "Best guess: Manages a dialogue with Rowena in Skara Brae, where she is under Horance’s control until awakened by a music box, then asks the player to deliver a ring to Trent.",
  "08D8": "Best guess: Manages a dialogue with Rowena in Skara Brae, where she asks to be escorted to Trent, joining the party if space is available, with options to discuss Trent or end the conversation.",
  "08D9": "Best guess: Manages Rowena’s unresponsive state in Skara Brae, displaying different messages based on a flag, indicating she cannot respond.",
  "08DA": "Best guess: Manages a dialogue with a ghost (likely Rowena) who is unwell and requests to postpone conversation.",
  "08DB": "Best guess: Manages a shop dialogue for purchasing spells from different magical circles, handling spell selection, pricing, and spellbook checks, similar to func_08BB, func_08C3, and func_08C5.",
  "08DC": "Best guess: Manages a shop dialogue for purchasing magical reagents, handling item selection, pricing, and inventory checks, similar to func_08C6.",
  "08DD": "Best guess: Manages NPC shape transformations during an earthquake event, cycling through predefined shapes based on random selection.",
  "08DE": "Best guess: Manages a dialogue with an ape-like creature requesting honey, offering a reward and setting a flag if honey is given, identical to func_08DF and func_08E0 except for NPC ID.",
  "08DF": "Best guess: Manages a dialogue with an ape-like creature requesting honey, offering a reward and setting a flag if honey is given, identical to func_08DE and func_08E0 except for NPC ID.",
  "08E0": "Best guess: Manages a dialogue with an ape-like creature requesting honey, offering a reward and setting a flag if honey is given, identical to func_08DE and func_08DF except for NPC ID.",
  "08E1": "Best guess: Manages a shop dialogue with a gargoyle vendor for purchasing potions and jewelry, handling item selection, pricing, and inventory checks.",
  "08E2": "Best guess: Manages a shop dialogue with a gargoyle vendor for purchasing magical reagents, handling item selection, pricing, and inventory checks, similar to func_08DC.",
  "08E3": "Best guess: Manages a shop dialogue for purchasing jewelry and gems, handling item selection, pricing, and inventory checks.",
  "08E4": "Best guess: Returns a constant value, likely used as a simple flag or status check in the game logic.",
  "08E5": "Best guess: Manages a combat training session with Sentri, teaching sword techniques, potentially increasing dexterity, with gold and experience checks.",
  "08E6": "Best guess: Removes items from a golem’s body, likely cleaning up inventory after a quest or event.",
  "08E7": "Best guess: Checks if the player’s position is within specific coordinate bounds, likely for triggering a quest or event.",
  "08E8": "Best guess: Searches party members’ inventories for a specific item (ankh), returning the item if found or zero if not.",
  "08E9": "Best guess: Checks if an item matches specific types and frames, likely for quest item validation, returning 1 if matched or 0 if not.",
  "08EA": "Best guess: Checks if an item matches a specific type and frame, likely for quest item validation, returning 1 if matched or 0 if not.",
  "08EB": "Best guess: Adjusts item positions based on type (sextant, map, or sextant part), moving them to specific coordinates for quest or puzzle purposes.",
  "08EC": "Best guess: Recites a poem about Hubert the Lion, likely for storytelling or a quest-related dialogue, with party member presence checks.",
  "08ED": "Best guess: Manages a dialogue with an ape-like creature requesting honey, offering a reward and setting a flag if honey is given, identical to func_08DE, func_08DF, func_08E0, and func_08EE except for NPC ID.",
  "08EE": "Best guess: Manages a dialogue with an ape-like creature requesting honey, offering a reward and setting a flag if honey is given, identical to func_08DE, func_08DF, func_08E0, and func_08ED except for NPC ID.",
  "08EF": "Best guess: Manages Trent’s dialogue in Skara Brae, progressing the Soul Cage quest, handling Rowena’s return, iron bar delivery, and cage completion, with topic selection.",
  "08F0": "Best guess: Manages a dialogue with Trent and Rowena after their reunion in Skara Brae, handling refusal of sacrifice and Rowena’s absence, with topic selection.",
  "08F1": "Best guess: Randomly selects an insult from a list, cycling until a different insult is chosen, used for NPC dialogue or confrontation.",
  "08F2": "Best guess: Manages a confrontational dialogue accusing the player of deception, demanding an apology or confession, with escalating consequences based on responses.",
  "08F3": "Best guess: Manages a dialogue with Shamino discussing combat preferences (valor vs. enchantment, melee vs. ranged), with gender-specific responses and flag-based progression.",
  "08F4": "Best guess: Manages a dialogue with Shamino, forgiving past deception, commenting on invisibility, and offering assistance, with topic selection for leaving or discussing bees.",
  "08F5": "Best guess: Manages a dialogue where an NPC greets party members, acknowledges the Avatar, and engages in specific conversations with Shamino and Spark, with flag-based progression.",
  "08F6": "Best guess: Calculates a value based on an NPC’s property, dividing it by 100 and iteratively halving until below 1, returning the iteration count.",
  "08F7": "Best guess: Checks if an NPC is in the player’s party and not affected by a specific status, returning true if both conditions are met, false otherwise.",
  "08F8": "Best guess: Manages item purchasing by NPCs, calculating quantity, checking gold, distributing items among party members, and returning a status code (0-3).",
  "08F9": "Best guess: Checks if values in one array are within bounds defined by another array, returning false if any value is out of bounds, true otherwise.",
  "08FA": "Best guess: Triggers an action for an item if specific properties (11 and 23) are not set, likely related to item interaction or quest progression.",
  "08FB": "Best guess: Returns the player’s name from the party members list, likely used for dialogue personalization.",
  "08FC": "Best guess: Compares the distance between two items to a threshold (20), returning true if less than the threshold, false otherwise, likely for proximity-based triggers.",
  "08FD": "Best guess: Checks an item’s property (76) and sets a variable based on its value, triggering an action if the value exceeds 6, likely for item state management.",
  "08FE": "Best guess: Retrieves a value and applies an action to an item using that value, likely for item manipulation or quest progression.",
  "08FF": "Best guess: Retrieves a value and applies a different action to an item using that value, likely for alternative item manipulation or quest progression.",
  "0900": "Best guess: Randomly selects between func_0901 and func_0902 to return an NPC ID.",
  "0901": "Best guess: Filters party members to find a valid NPC, defaulting to 356 if none found.",
  "0902": "Best guess: Iterates over negative indices to find a party member not in the party, defaulting to 356.",
  "0903": "Best guess: Handles pig NPC dialogue, saying \"Oink\" or performing actions based on flags.",
  "0904": "Best guess: Similar to func_0903, with item-based \"Oink\" dialogue or action performance.",
  "0905": "Best guess: Manages a newly lit torch, destroying it and setting properties.",
  "0906": "Best guess: Checks a condition (opcode 0044H) to return true/false.",
  "0907": "Best guess: Returns the position of an item’s owner.",
  "0908": "Best guess: Returns the player’s name based on a condition (opcode 0022H).",
  "0909": "Best guess: Returns \"milord\" or \"milady\" based on player gender.",
  "090A": "Best guess: Prompts the user with a Yes/No choice, returning true for “Yes” and false for “No”.",
  "090B": "Best guess: Displays a list of string options, adds them as answers, and returns the selected option’s string.",
  "090C": "Best guess: Displays a list of string options, adds them as answers, and returns the 1-based index of the selected option.",
  "090D": "Best guess: Prompts the user to select a party member or “Nobody”, returning the selected member’s ID or 0, starting with the party leader.",
  "090E": "Best guess: Prompts the user to select a party member or “Nobody”, returning the selected member’s ID or 0.",
  "090F": "Best guess: Returns the name of a specified character ID.",
  "0910": "Best guess: Retrieves an NPC’s training level for a given property.",
  "0911": "Best guess: Sets a quest-related property (ID 8) for all party members.",
  "0912": "Best guess: Sets an NPC’s training level for a given property.",
  "0913": "Best guess: Counts iterations until a target value is matched, returning the count.",
  "0914": "Best guess: Initializes training levels for an NPC (properties 0 and 3).",
  "0915": "Best guess: Improves an NPC’s dexterity training level based on strength.",
  "0916": "Best guess: Initializes multiple training levels for an NPC (properties 2 and 7).",
  "0917": "Best guess: Improves an NPC’s combat skill training level based on strength and dexterity.",
  "0918": "Best guess: Improves an NPC’s intelligence training level based on strength and intelligence.",
  "0919": "This function is called by Fellowship members who are asked about the Fellowship.",
  "091A": "Best guess: Explains The Fellowship’s philosophy and offers to join, directing the player to Batlin if interested, or noting existing membership.",
  "091B": "Best guess: Formats a shop price string (e.g., “sells ham for 10 gold.”) based on item name, price, and quantity, adjusting verb for singular/plural.",
  "091C": "Best guess: Formats a shop price string in gargoyle syntax (e.g., “To sell item for 10 gold.”) for use in shop dialogue.",
  "091D": "Best guess: Heals a character’s wounds, restoring health to maximum if injured, deducting gold, and displaying appropriate messages.",
  "091E": "Best guess: Cures poison for a character, checking if they are poisoned, deducting gold, and displaying a success or failure message.",
  "091F": "Best guess: Resurrects a character, deducting gold if successful, and displays a success or failure message.",
  "0921": "Best guess: Displays party member names for training selection, returning the selected NPC ID or 0 if \"Nobody\" is chosen.",
  "0922": "Evaluates training ability, checking gold and training level caps, returning 0 (insufficient experience), 1 (insufficient gold), 2 (maxed out), or 3 (can train).",
  "0923": "Best guess: Handles spell purchase, checking gold and spellbook space, returning 0 (declined), 1 (success), 2 (no spellbook), 3 (insufficient gold), or 4 (no space).",
  "0924": "Best guess: Similar to func_0923, handles spell purchase with slight dialogue variation.",
  "0925": "Best guess: Manages item quantity, decrementing or removing items based on quantity.",
  "0926": "Best guess: Searches party members’ containers for a specific item, updating positions if found.",
  "0927": "Best guess: Provides dialogue for liquid containers, suggesting liquids or commenting on use if the frame is non-zero.",
  "0928": "Best guess: Similar to func_0927, but uses a modulo check on the item frame for liquid containers.",
  "0929": "Best guess: Offers combat advice for hand items, suggesting to hit someone or performing a default action.",
  "092A": "Best guess: Adjusts a character’s health (NPC property 3) by adding or subtracting damage, ensuring it stays within bounds.",
  "092B": "Best guess: Increments a counter up to 13 and returns the final value, likely used for tracking or timing.",
  "092C": "Best guess: Plays a sound effect (ID 75), likely used for ambient or event-driven audio cues.",
  "092D": "Best guess: Returns the direction from the Avatar to a specified item or character, likely used for orientation or movement.",
  "092E": "Best guess: Makes an NPC randomly say a context-specific phrase based on their state (e.g., working, eating, playing tag), tailored to human NPCs.",
  "092F": "Best guess: Makes a gargoyle NPC randomly say a context-specific phrase in their syntax (e.g., “To say hello!”), based on their state.",
  "0930": "Best guess: Calls an unknown function with three arguments, possibly for NPC interaction or state modification.",
  "0931": "Best guess: Checks if a party has sufficient items of a specific type, returning true if the condition is met.",
  "0932": "Best guess: Normalizes an input value, ensuring it’s positive by multiplying by -1 if negative.",
  "0933": "Best guess: Checks an item’s status via func_0937, then adds items to a container if the condition fails.",
  "0934": "Best guess: Filters party members based on a flag check, returning a list of matching NPCs.",
  "0935": "Best guess: Compares item attributes across a list, updating a value to the smallest attribute.",
  "0936": "Best guess: Calls an unknown function with three arguments, possibly for NPC health or state modification.",
  "0937": "Best guess: Checks multiple NPC properties and flags, returning true if all conditions are met (e.g., for eligibility or state validation).",
  "0938": "Best guess: Similar to func_0937, checks NPC flags and properties, returning true if any condition is met.",
  "0939": "Best guess: Validates an NPC ID, ensuring it’s within a valid range or returning its owner.",
  "093A": "Best guess: Applies status effects to party members with sufficient mana, updating their properties and transforming specific items in a radius.",
  "093B": "Best guess: Adjusts an NPC’s property by subtracting a value, capping at the maximum or a calculated threshold.",
  "093C": "Best guess: Creates a new array from an input array, excluding a specified element.",
  "093D": "Best guess: Sorts an array of distances using bubble sort, returning the sorted array.",
  "093E": "Best guess: Returns the coordinates of a specific location based on predefined arrays, possibly for navigation or teleportation.",
  "093F": "Best guess: Removes an NPC from the party if they are a member and a specific flag is set, updating their state.",
  "0940": "Best guess: Initiates NPC speech, calling an external function if speech fails.",
  "0941": "Best guess: Similar to func_0940, checks speech status and calls an external function if speech fails.",
  "0942": "Best guess: Manages a torch or candle, setting quality, checking type, and triggering effects or func_0905 for spent items.",
  "0943": "Best guess: Triggers an explosion effect at a specific position with multiple parameters.",
  "0944": "Best guess: Finds the outermost container of an item, ensuring it’s not owned by the Avatar (ID 356).",
  "0945": "Best guess: Iterates through nested containers to find the outermost container.",
  "0946": "Best guess: Handles purchase of bakery items (e.g., pastry, bread), with dialogue and inventory checks.",
  "0947": "Best guess: Manages bread delivery, counting loaves and rewarding gold if sufficient.",
  "0948": "Best guess: Manages flour delivery, counting sacks and rewarding gold if sufficient.",
  "0949": "Best guess: Handles potion purchase with flag-based pricing adjustments and dialogue.",
  "094A": "Best guess: Manages a shop interaction for purchasing magical reagents (e.g., black pearl, mandrake root), with haggling and inventory checks.",
  "094B": "Best guess: Manages a haggling interaction for an item’s price, allowing the player to counter-offer and returning the final agreed price.",
  "094C": "Best guess: Manages a magic shop interaction, allowing the purchase of spells from various circles, with spellbook and gold checks.",
  "094D": "Best guess: Manages a food shop interaction, allowing the purchase of items (e.g., flounder, bread) with quantity and price validation.",
  "094E": "Best guess: Manages a tavern interaction, allowing the purchase of drinks (ale, wine, mead) with price and inventory validation.",
  "094F": "Best guess: Manages a combat training session, checking player strength and gold, enhancing strength if conditions are met.",
  "0950": "Best guess: Manages a boxing training session with Zella, checking experience, gold, and proficiency, and improving dexterity or combat skills.",
  "0951": "Best guess: Handles tavern item purchases (e.g., ale, wine, Silverleaf), with a flag-based unavailability message for Silverleaf.",
  "0952": "Best guess: Manages weapon purchases (e.g., 2-handed axe, dagger) with dialogue and inventory checks.",
  "0953": "Best guess: Manages armor purchases (e.g., crested helm, plate armor) with dialogue and inventory checks."
}